una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91rm9200.h
/* -------- TCB_BCR : (TCB Offset: 0xc0) TC Block Control Register -------- */
#define AT91C_TCB_SYNC        ((unsigned int) 0x1 <<  0) /* (TCB) Synchro Command*/
/* -------- TCB_BMR : (TCB Offset: 0xc4) TC Block Mode Register -------- */
#define AT91C_TCB_TC0XC0S     ((unsigned int) 0x3 <<  0) /* (TCB) External Clock Signal 0 Selection*/
#define 	AT91C_TCB_TC0XC0S_TCLK0                ((unsigned int) 0x0) /* (TCB) TCLK0 connected to XC0*/
#define 	AT91C_TCB_TC0XC0S_NONE                 ((unsigned int) 0x1) /* (TCB) None signal connected to XC0*/
#define 	AT91C_TCB_TC0XC0S_TIOA1                ((unsigned int) 0x2) /* (TCB) TIOA1 connected to XC0*/
#define 	AT91C_TCB_TC0XC0S_TIOA2                ((unsigned int) 0x3) /* (TCB) TIOA2 connected to XC0*/
#define AT91C_TCB_TC1XC1S     ((unsigned int) 0x3 <<  2) /* (TCB) External Clock Signal 1 Selection*/
#define 	AT91C_TCB_TC1XC1S_TCLK1                ((unsigned int) 0x0 <<  2) /* (TCB) TCLK1 connected to XC1*/
#define 	AT91C_TCB_TC1XC1S_NONE                 ((unsigned int) 0x1 <<  2) /* (TCB) None signal connected to XC1*/
#define 	AT91C_TCB_TC1XC1S_TIOA0                ((unsigned int) 0x2 <<  2) /* (TCB) TIOA0 connected to XC1*/
#define 	AT91C_TCB_TC1XC1S_TIOA2                ((unsigned int) 0x3 <<  2) /* (TCB) TIOA2 connected to XC1*/
#define AT91C_TCB_TC2XC2S     ((unsigned int) 0x3 <<  4) /* (TCB) External Clock Signal 2 Selection*/
#define 	AT91C_TCB_TC2XC2S_TCLK2                ((unsigned int) 0x0 <<  4) /* (TCB) TCLK2 connected to XC2*/
#define 	AT91C_TCB_TC2XC2S_NONE                 ((unsigned int) 0x1 <<  4) /* (TCB) None signal connected to XC2*/
#define 	AT91C_TCB_TC2XC2S_TIOA0                ((unsigned int) 0x2 <<  4) /* (TCB) TIOA0 connected to XC2*/
#define 	AT91C_TCB_TC2XC2S_TIOA1                ((unsigned int) 0x3 <<  4) /* (TCB) TIOA2 connected to XC2*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR USB Host Interface*/
/* ******************************************************************************/
typedef struct _AT91S_UHP {
	AT91_REG	 UHP_HcRevision; 	/* Revision*/
	AT91_REG	 UHP_HcControl; 	/* Operating modes for the Host Controller*/
	AT91_REG	 UHP_HcCommandStatus; 	/* Command & status Register*/
	AT91_REG	 UHP_HcInterruptStatus; 	/* Interrupt Status Register*/
	AT91_REG	 UHP_HcInterruptEnable; 	/* Interrupt Enable Register*/
	AT91_REG	 UHP_HcInterruptDisable; 	/* Interrupt Disable Register*/
	AT91_REG	 UHP_HcHCCA; 	/* Pointer to the Host Controller Communication Area*/
	AT91_REG	 UHP_HcPeriodCurrentED; 	/* Current Isochronous or Interrupt Endpoint Descriptor*/
	AT91_REG	 UHP_HcControlHeadED; 	/* First Endpoint Descriptor of the Control list*/
	AT91_REG	 UHP_HcControlCurrentED; 	/* Endpoint Control and Status Register*/
	AT91_REG	 UHP_HcBulkHeadED; 	/* First endpoint register of the Bulk list*/
	AT91_REG	 UHP_HcBulkCurrentED; 	/* Current endpoint of the Bulk list*/
	AT91_REG	 UHP_HcBulkDoneHead; 	/* Last completed transfer descriptor*/
	AT91_REG	 UHP_HcFmInterval; 	/* Bit time between 2 consecutive SOFs*/
	AT91_REG	 UHP_HcFmRemaining; 	/* Bit time remaining in the current Frame*/
	AT91_REG	 UHP_HcFmNumber; 	/* Frame number*/
	AT91_REG	 UHP_HcPeriodicStart; 	/* Periodic Start*/
	AT91_REG	 UHP_HcLSThreshold; 	/* LS Threshold*/
	AT91_REG	 UHP_HcRhDescriptorA; 	/* Root Hub characteristics A*/
	AT91_REG	 UHP_HcRhDescriptorB; 	/* Root Hub characteristics B*/
	AT91_REG	 UHP_HcRhStatus; 	/* Root Hub Status register*/
	AT91_REG	 UHP_HcRhPortStatus[2]; 	/* Root Hub Port Status Register*/
} AT91S_UHP, *AT91PS_UHP;


/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Ethernet MAC*/
/* ******************************************************************************/
typedef struct _AT91S_EMAC {
	AT91_REG	 EMAC_CTL; 	/* Network Control Register*/
	AT91_REG	 EMAC_CFG; 	/* Network Configuration Register*/
	AT91_REG	 EMAC_SR; 	/* Network Status Register*/
	AT91_REG	 EMAC_TAR; 	/* Transmit Address Register*/
	AT91_REG	 EMAC_TCR; 	/* Transmit Control Register*/
	AT91_REG	 EMAC_TSR; 	/* Transmit Status Register*/
	AT91_REG	 EMAC_RBQP; 	/* Receive Buffer Queue Pointer*/
	AT91_REG	 Reserved0[1]; 	/* */
	AT91_REG	 EMAC_RSR; 	/* Receive Status Register*/
	AT91_REG	 EMAC_ISR; 	/* Interrupt Status Register*/
	AT91_REG	 EMAC_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 EMAC_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 EMAC_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 EMAC_MAN; 	/* PHY Maintenance Register*/
	AT91_REG	 Reserved1[2]; 	/* */
	AT91_REG	 EMAC_FRA; 	/* Frames Transmitted OK Register*/
	AT91_REG	 EMAC_SCOL; 	/* Single Collision Frame Register*/
	AT91_REG	 EMAC_MCOL; 	/* Multiple Collision Frame Register*/
	AT91_REG	 EMAC_OK; 	/* Frames Received OK Register*/
	AT91_REG	 EMAC_SEQE; 	/* Frame Check Sequence Error Register*/
	AT91_REG	 EMAC_ALE; 	/* Alignment Error Register*/
	AT91_REG	 EMAC_DTE; 	/* Deferred Transmission Frame Register*/
	AT91_REG	 EMAC_LCOL; 	/* Late Collision Register*/
	AT91_REG	 EMAC_ECOL; 	/* Excessive Collision Register*/
	AT91_REG	 EMAC_CSE; 	/* Carrier Sense Error Register*/
	AT91_REG	 EMAC_TUE; 	/* Transmit Underrun Error Register*/
	AT91_REG	 EMAC_CDE; 	/* Code Error Register*/
	AT91_REG	 EMAC_ELR; 	/* Excessive Length Error Register*/
	AT91_REG	 EMAC_RJB; 	/* Receive Jabber Register*/
	AT91_REG	 EMAC_USF; 	/* Undersize Frame Register*/
	AT91_REG	 EMAC_SQEE; 	/* SQE Test Error Register*/
	AT91_REG	 EMAC_DRFC; 	/* Discarded RX Frame Register*/
	AT91_REG	 Reserved2[3]; 	/* */
	AT91_REG	 EMAC_HSH; 	/* Hash Address High[63:32]*/
	AT91_REG	 EMAC_HSL; 	/* Hash Address Low[31:0]*/
	AT91_REG	 EMAC_SA1L; 	/* Specific Address 1 Low, First 4 bytes*/
	AT91_REG	 EMAC_SA1H; 	/* Specific Address 1 High, Last 2 bytes*/
	AT91_REG	 EMAC_SA2L; 	/* Specific Address 2 Low, First 4 bytes*/
	AT91_REG	 EMAC_SA2H; 	/* Specific Address 2 High, Last 2 bytes*/
	AT91_REG	 EMAC_SA3L; 	/* Specific Address 3 Low, First 4 bytes*/
	AT91_REG	 EMAC_SA3H; 	/* Specific Address 3 High, Last 2 bytes*/
	AT91_REG	 EMAC_SA4L; 	/* Specific Address 4 Low, First 4 bytes*/
	AT91_REG	 EMAC_SA4H; 	/* Specific Address 4 High, Last 2 bytesr*/
} AT91S_EMAC, *AT91PS_EMAC;

/* -------- EMAC_CTL : (EMAC Offset: 0x0)  -------- */
#define AT91C_EMAC_LB         ((unsigned int) 0x1 <<  0) /* (EMAC) Loopback. Optional. When set, loopback signal is at high level.*/
#define AT91C_EMAC_LBL        ((unsigned int) 0x1 <<  1) /* (EMAC) Loopback local. */
#define AT91C_EMAC_RE         ((unsigned int) 0x1 <<  2) /* (EMAC) Receive enable. */
#define AT91C_EMAC_TE         ((unsigned int) 0x1 <<  3) /* (EMAC) Transmit enable. */
#define AT91C_EMAC_MPE        ((unsigned int) 0x1 <<  4) /* (EMAC) Management port enable. */
#define AT91C_EMAC_CSR        ((unsigned int) 0x1 <<  5) /* (EMAC) Clear statistics registers. */
#define AT91C_EMAC_ISR        ((unsigned int) 0x1 <<  6) /* (EMAC) Increment statistics registers. */
#define AT91C_EMAC_WES        ((unsigned int) 0x1 <<  7) /* (EMAC) Write enable for statistics registers. */
#define AT91C_EMAC_BP         ((unsigned int) 0x1 <<  8) /* (EMAC) Back pressure. */
/* -------- EMAC_CFG : (EMAC Offset: 0x4) Network Configuration Register -------- */
#define AT91C_EMAC_SPD        ((unsigned int) 0x1 <<  0) /* (EMAC) Speed. */
#define AT91C_EMAC_FD         ((unsigned int) 0x1 <<  1) /* (EMAC) Full duplex. */
#define AT91C_EMAC_BR         ((unsigned int) 0x1 <<  2) /* (EMAC) Bit rate. */
#define AT91C_EMAC_CAF        ((unsigned int) 0x1 <<  4) /* (EMAC) Copy all frames. */
#define AT91C_EMAC_NBC        ((unsigned int) 0x1 <<  5) /* (EMAC) No broadcast. */
#define AT91C_EMAC_MTI        ((unsigned int) 0x1 <<  6) /* (EMAC) Multicast hash enable*/
#define AT91C_EMAC_UNI        ((unsigned int) 0x1 <<  7) /* (EMAC) Unicast hash enable. */
#define AT91C_EMAC_BIG        ((unsigned int) 0x1 <<  8) /* (EMAC) Receive 1522 bytes. */
#define AT91C_EMAC_EAE        ((unsigned int) 0x1 <<  9) /* (EMAC) External address match enable. */
#define AT91C_EMAC_CLK        ((unsigned int) 0x3 << 10) /* (EMAC) */
#define 	AT91C_EMAC_CLK_HCLK_8               ((unsigned int) 0x0 << 10) /* (EMAC) HCLK divided by 8*/
#define 	AT91C_EMAC_CLK_HCLK_16              ((unsigned int) 0x1 << 10) /* (EMAC) HCLK divided by 16*/
#define 	AT91C_EMAC_CLK_HCLK_32              ((unsigned int) 0x2 << 10) /* (EMAC) HCLK divided by 32*/
#define 	AT91C_EMAC_CLK_HCLK_64              ((unsigned int) 0x3 << 10) /* (EMAC) HCLK divided by 64*/
#define AT91C_EMAC_RTY        ((unsigned int) 0x1 << 12) /* (EMAC) */
#define AT91C_EMAC_RMII       ((unsigned int) 0x1 << 13) /* (EMAC) */
/* -------- EMAC_SR : (EMAC Offset: 0x8) Network Status Register -------- */
#define AT91C_EMAC_MDIO       ((unsigned int) 0x1 <<  1) /* (EMAC) */
#define AT91C_EMAC_IDLE       ((unsigned int) 0x1 <<  2) /* (EMAC) */
/* -------- EMAC_TCR : (EMAC Offset: 0x10) Transmit Control Register -------- */
#define AT91C_EMAC_LEN        ((unsigned int) 0x7FF <<  0) /* (EMAC) */
#define AT91C_EMAC_NCRC       ((unsigned int) 0x1 << 15) /* (EMAC) */
/* -------- EMAC_TSR : (EMAC Offset: 0x14) Transmit Control Register -------- */
#define AT91C_EMAC_OVR        ((unsigned int) 0x1 <<  0) /* (EMAC) */
#define AT91C_EMAC_COL        ((unsigned int) 0x1 <<  1) /* (EMAC) */
#define AT91C_EMAC_RLE        ((unsigned int) 0x1 <<  2) /* (EMAC) */
#define AT91C_EMAC_TXIDLE     ((unsigned int) 0x1 <<  3) /* (EMAC) */
#define AT91C_EMAC_BNQ        ((unsigned int) 0x1 <<  4) /* (EMAC) */
#define AT91C_EMAC_COMP       ((unsigned int) 0x1 <<  5) /* (EMAC) */
#define AT91C_EMAC_UND        ((unsigned int) 0x1 <<  6) /* (EMAC) */
/* -------- EMAC_RSR : (EMAC Offset: 0x20) Receive Status Register -------- */
#define AT91C_EMAC_BNA        ((unsigned int) 0x1 <<  0) /* (EMAC) */
#define AT91C_EMAC_REC        ((unsigned int) 0x1 <<  1) /* (EMAC) */
/* -------- EMAC_ISR : (EMAC Offset: 0x24) Interrupt Status Register -------- */
#define AT91C_EMAC_DONE       ((unsigned int) 0x1 <<  0) /* (EMAC) */
#define AT91C_EMAC_RCOM       ((unsigned int) 0x1 <<  1) /* (EMAC) */
#define AT91C_EMAC_RBNA       ((unsigned int) 0x1 <<  2) /* (EMAC) */
#define AT91C_EMAC_TOVR       ((unsigned int) 0x1 <<  3) /* (EMAC) */
#define AT91C_EMAC_TUND       ((unsigned int) 0x1 <<  4) /* (EMAC) */
#define AT91C_EMAC_RTRY       ((unsigned int) 0x1 <<  5) /* (EMAC) */
#define AT91C_EMAC_TBRE       ((unsigned int) 0x1 <<  6) /* (EMAC) */
#define AT91C_EMAC_TCOM       ((unsigned int) 0x1 <<  7) /* (EMAC) */
#define AT91C_EMAC_TIDLE      ((unsigned int) 0x1 <<  8) /* (EMAC) */
#define AT91C_EMAC_LINK       ((unsigned int) 0x1 <<  9) /* (EMAC) */
#define AT91C_EMAC_ROVR       ((unsigned int) 0x1 << 10) /* (EMAC) */
#define AT91C_EMAC_HRESP      ((unsigned int) 0x1 << 11) /* (EMAC) */
/* -------- EMAC_IER : (EMAC Offset: 0x28) Interrupt Enable Register -------- */
/* -------- EMAC_IDR : (EMAC Offset: 0x2c) Interrupt Disable Register -------- */
/* -------- EMAC_IMR : (EMAC Offset: 0x30) Interrupt Mask Register -------- */
/* -------- EMAC_MAN : (EMAC Offset: 0x34) PHY Maintenance Register -------- */
#define AT91C_EMAC_DATA       ((unsigned int) 0xFFFF <<  0) /* (EMAC) */
#define AT91C_EMAC_CODE       ((unsigned int) 0x3 << 16) /* (EMAC) */
#define AT91C_EMAC_REGA       ((unsigned int) 0x1F << 18) /* (EMAC) */
#define AT91C_EMAC_PHYA       ((unsigned int) 0x1F << 23) /* (EMAC) */
#define AT91C_EMAC_RW         ((unsigned int) 0x3 << 28) /* (EMAC) */
#define AT91C_EMAC_HIGH       ((unsigned int) 0x1 << 30) /* (EMAC) */
#define AT91C_EMAC_LOW        ((unsigned int) 0x1 << 31) /* (EMAC) */

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR External Bus Interface*/
/* ******************************************************************************/
typedef struct _AT91S_EBI {
	AT91_REG	 EBI_CSA; 	/* Chip Select Assignment Register*/
	AT91_REG	 EBI_CFGR; 	/* Configuration Register*/
} AT91S_EBI, *AT91PS_EBI;

/* -------- EBI_CSA : (EBI Offset: 0x0) Chip Select Assignment Register -------- */
#define AT91C_EBI_CS0A        ((unsigned int) 0x1 <<  0) /* (EBI) Chip Select 0 Assignment*/
#define 	AT91C_EBI_CS0A_SMC                  ((unsigned int) 0x0) /* (EBI) Chip Select 0 is assigned to the Static Memory Controller.*/
#define 	AT91C_EBI_CS0A_BFC                  ((unsigned int) 0x1) /* (EBI) Chip Select 0 is assigned to the Burst Flash Controller.*/
#define AT91C_EBI_CS1A        ((unsigned int) 0x1 <<  1) /* (EBI) Chip Select 1 Assignment*/
#define 	AT91C_EBI_CS1A_SMC                  ((unsigned int) 0x0 <<  1) /* (EBI) Chip Select 1 is assigned to the Static Memory Controller.*/
#define 	AT91C_EBI_CS1A_SDRAMC               ((unsigned int) 0x1 <<  1) /* (EBI) Chip Select 1 is assigned to the SDRAM Controller.*/
#define AT91C_EBI_CS3A        ((unsigned int) 0x1 <<  3) /* (EBI) Chip Select 3 Assignment*/
#define 	AT91C_EBI_CS3A_SMC                  ((unsigned int) 0x0 <<  3) /* (EBI) Chip Select 3 is only assigned to the Static Memory Controller and NCS3 behaves as defined by the SMC2.*/
#define 	AT91C_EBI_CS3A_SMC_SmartMedia       ((unsigned int) 0x1 <<  3) /* (EBI) Chip Select 3 is assigned to the Static Memory Controller and the SmartMedia Logic is activated.*/
#define AT91C_EBI_CS4A        ((unsigned int) 0x1 <<  4) /* (EBI) Chip Select 4 Assignment*/
#define 	AT91C_EBI_CS4A_SMC                  ((unsigned int) 0x0 <<  4) /* (EBI) Chip Select 4 is assigned to the Static Memory Controller and NCS4,NCS5 and NCS6 behave as defined by the SMC2.*/
#define 	AT91C_EBI_CS4A_SMC_CompactFlash     ((unsigned int) 0x1 <<  4) /* (EBI) Chip Select 4 is assigned to the Static Memory Controller and the CompactFlash Logic is activated.*/
/* -------- EBI_CFGR : (EBI Offset: 0x4) Configuration Register -------- */
#define AT91C_EBI_DBPUC       ((unsigned int) 0x1 <<  0) /* (EBI) Data Bus Pull-Up Configuration*/
#define AT91C_EBI_EBSEN       ((unsigned int) 0x1 <<  1) /* (EBI) Bus Sharing Enable*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Static Memory Controller 2 Interface*/
/* ******************************************************************************/
typedef struct _AT91S_SMC2 {
	AT91_REG	 SMC2_CSR[8]; 	/* SMC2 Chip Select Register*/
} AT91S_SMC2, *AT91PS_SMC2;

/* -------- SMC2_CSR : (SMC2 Offset: 0x0) SMC2 Chip Select Register -------- */
#define AT91C_SMC2_NWS        ((unsigned int) 0x7F <<  0) /* (SMC2) Number of Wait States*/
#define AT91C_SMC2_WSEN       ((unsigned int) 0x1 <<  7) /* (SMC2) Wait State Enable*/
#define AT91C_SMC2_TDF        ((unsigned int) 0xF <<  8) /* (SMC2) Data Float Time*/
#define AT91C_SMC2_BAT        ((unsigned int) 0x1 << 12) /* (SMC2) Byte Access Type*/
#define AT91C_SMC2_DBW        ((unsigned int) 0x1 << 13) /* (SMC2) Data Bus Width*/
#define 	AT91C_SMC2_DBW_16                   ((unsigned int) 0x1 << 13) /* (SMC2) 16-bit.*/
#define 	AT91C_SMC2_DBW_8                    ((unsigned int) 0x2 << 13) /* (SMC2) 8-bit.*/
#define AT91C_SMC2_DRP        ((unsigned int) 0x1 << 15) /* (SMC2) Data Read Protocol*/
#define AT91C_SMC2_ACSS       ((unsigned int) 0x3 << 16) /* (SMC2) Address to Chip Select Setup*/
#define 	AT91C_SMC2_ACSS_STANDARD             ((unsigned int) 0x0 << 16) /* (SMC2) Standard, asserted at the beginning of the access and deasserted at the end.*/
#define 	AT91C_SMC2_ACSS_1_CYCLE              ((unsigned int) 0x1 << 16) /* (SMC2) One cycle less at the beginning and the end of the access.*/
#define 	AT91C_SMC2_ACSS_2_CYCLES             ((unsigned int) 0x2 << 16) /* (SMC2) Two cycles less at the beginning and the end of the access.*/
#define 	AT91C_SMC2_ACSS_3_CYCLES             ((unsigned int) 0x3 << 16) /* (SMC2) Three cycles less at the beginning and the end of the access.*/
#define AT91C_SMC2_RWSETUP    ((unsigned int) 0x7 << 24) /* (SMC2) Read and Write Signal Setup Time*/
#define AT91C_SMC2_RWHOLD     ((unsigned int) 0x7 << 28) /* (SMC2) Read and Write Signal Hold Time*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR SDRAM Controller Interface*/
/* ******************************************************************************/
typedef struct _AT91S_SDRC {
	AT91_REG	 SDRC_MR; 	/* SDRAM Controller Mode Register*/
	AT91_REG	 SDRC_TR; 	/* SDRAM Controller Refresh Timer Register*/
	AT91_REG	 SDRC_CR; 	/* SDRAM Controller Configuration Register*/
	AT91_REG	 SDRC_SRR; 	/* SDRAM Controller Self Refresh Register*/
	AT91_REG	 SDRC_LPR; 	/* SDRAM Controller Low Power Register*/
	AT91_REG	 SDRC_IER; 	/* SDRAM Controller Interrupt Enable Register*/
	AT91_REG	 SDRC_IDR; 	/* SDRAM Controller Interrupt Disable Register*/
	AT91_REG	 SDRC_IMR; 	/* SDRAM Controller Interrupt Mask Register*/
	AT91_REG	 SDRC_ISR; 	/* SDRAM Controller Interrupt Mask Register*/
} AT91S_SDRC, *AT91PS_SDRC;

