una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91rm9200.h
/* -------- SDRC_MR : (SDRC Offset: 0x0) SDRAM Controller Mode Register -------- */
#define AT91C_SDRC_MODE       ((unsigned int) 0xF <<  0) /* (SDRC) Mode*/
#define 	AT91C_SDRC_MODE_NORMAL_CMD           ((unsigned int) 0x0) /* (SDRC) Normal Mode*/
#define 	AT91C_SDRC_MODE_NOP_CMD              ((unsigned int) 0x1) /* (SDRC) NOP Command*/
#define 	AT91C_SDRC_MODE_PRCGALL_CMD          ((unsigned int) 0x2) /* (SDRC) All Banks Precharge Command*/
#define 	AT91C_SDRC_MODE_LMR_CMD              ((unsigned int) 0x3) /* (SDRC) Load Mode Register Command*/
#define 	AT91C_SDRC_MODE_RFSH_CMD             ((unsigned int) 0x4) /* (SDRC) Refresh Command*/
#define AT91C_SDRC_DBW        ((unsigned int) 0x1 <<  4) /* (SDRC) Data Bus Width*/
#define 	AT91C_SDRC_DBW_32_BITS              ((unsigned int) 0x0 <<  4) /* (SDRC) 32 Bits datas bus*/
#define 	AT91C_SDRC_DBW_16_BITS              ((unsigned int) 0x1 <<  4) /* (SDRC) 16 Bits datas bus*/
/* -------- SDRC_TR : (SDRC Offset: 0x4) SDRC Refresh Timer Register -------- */
#define AT91C_SDRC_COUNT      ((unsigned int) 0xFFF <<  0) /* (SDRC) Refresh Counter*/
/* -------- SDRC_CR : (SDRC Offset: 0x8) SDRAM Configuration Register -------- */
#define AT91C_SDRC_NC         ((unsigned int) 0x3 <<  0) /* (SDRC) Number of Column Bits*/
#define 	AT91C_SDRC_NC_8                    ((unsigned int) 0x0) /* (SDRC) 8 Bits*/
#define 	AT91C_SDRC_NC_9                    ((unsigned int) 0x1) /* (SDRC) 9 Bits*/
#define 	AT91C_SDRC_NC_10                   ((unsigned int) 0x2) /* (SDRC) 10 Bits*/
#define 	AT91C_SDRC_NC_11                   ((unsigned int) 0x3) /* (SDRC) 11 Bits*/
#define AT91C_SDRC_NR         ((unsigned int) 0x3 <<  2) /* (SDRC) Number of Row Bits*/
#define 	AT91C_SDRC_NR_11                   ((unsigned int) 0x0 <<  2) /* (SDRC) 11 Bits*/
#define 	AT91C_SDRC_NR_12                   ((unsigned int) 0x1 <<  2) /* (SDRC) 12 Bits*/
#define 	AT91C_SDRC_NR_13                   ((unsigned int) 0x2 <<  2) /* (SDRC) 13 Bits*/
#define AT91C_SDRC_NB         ((unsigned int) 0x1 <<  4) /* (SDRC) Number of Banks*/
#define 	AT91C_SDRC_NB_2_BANKS              ((unsigned int) 0x0 <<  4) /* (SDRC) 2 banks*/
#define 	AT91C_SDRC_NB_4_BANKS              ((unsigned int) 0x1 <<  4) /* (SDRC) 4 banks*/
#define AT91C_SDRC_CAS        ((unsigned int) 0x3 <<  5) /* (SDRC) CAS Latency*/
#define 	AT91C_SDRC_CAS_2                    ((unsigned int) 0x2 <<  5) /* (SDRC) 2 cycles*/
#define AT91C_SDRC_TWR        ((unsigned int) 0xF <<  7) /* (SDRC) Number of Write Recovery Time Cycles*/
#define AT91C_SDRC_TRC        ((unsigned int) 0xF << 11) /* (SDRC) Number of RAS Cycle Time Cycles*/
#define AT91C_SDRC_TRP        ((unsigned int) 0xF << 15) /* (SDRC) Number of RAS Precharge Time Cycles*/
#define AT91C_SDRC_TRCD       ((unsigned int) 0xF << 19) /* (SDRC) Number of RAS to CAS Delay Cycles*/
#define AT91C_SDRC_TRAS       ((unsigned int) 0xF << 23) /* (SDRC) Number of RAS Active Time Cycles*/
#define AT91C_SDRC_TXSR       ((unsigned int) 0xF << 27) /* (SDRC) Number of Command Recovery Time Cycles*/
/* -------- SDRC_SRR : (SDRC Offset: 0xc) SDRAM Controller Self-refresh Register -------- */
#define AT91C_SDRC_SRCB       ((unsigned int) 0x1 <<  0) /* (SDRC) Self-refresh Command Bit*/
/* -------- SDRC_LPR : (SDRC Offset: 0x10) SDRAM Controller Low-power Register -------- */
#define AT91C_SDRC_LPCB       ((unsigned int) 0x1 <<  0) /* (SDRC) Low-power Command Bit*/
/* -------- SDRC_IER : (SDRC Offset: 0x14) SDRAM Controller Interrupt Enable Register -------- */
#define AT91C_SDRC_RES        ((unsigned int) 0x1 <<  0) /* (SDRC) Refresh Error Status*/
/* -------- SDRC_IDR : (SDRC Offset: 0x18) SDRAM Controller Interrupt Disable Register -------- */
/* -------- SDRC_IMR : (SDRC Offset: 0x1c) SDRAM Controller Interrupt Mask Register -------- */
/* -------- SDRC_ISR : (SDRC Offset: 0x20) SDRAM Controller Interrupt Status Register -------- */

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Burst Flash Controller Interface*/
/* ******************************************************************************/
typedef struct _AT91S_BFC {
	AT91_REG	 BFC_MR; 	/* BFC Mode Register*/
} AT91S_BFC, *AT91PS_BFC;

/* -------- BFC_MR : (BFC Offset: 0x0) BFC Mode Register -------- */
#define AT91C_BFC_BFCOM       ((unsigned int) 0x3 <<  0) /* (BFC) Burst Flash Controller Operating Mode*/
#define 	AT91C_BFC_BFCOM_DISABLED             ((unsigned int) 0x0) /* (BFC) NPCS0 is driven by the SMC or remains high.*/
#define 	AT91C_BFC_BFCOM_ASYNC                ((unsigned int) 0x1) /* (BFC) Asynchronous*/
#define 	AT91C_BFC_BFCOM_BURST_READ           ((unsigned int) 0x2) /* (BFC) Burst Read*/
#define AT91C_BFC_BFCC        ((unsigned int) 0x3 <<  2) /* (BFC) Burst Flash Controller Operating Mode*/
#define 	AT91C_BFC_BFCC_MCK                  ((unsigned int) 0x1 <<  2) /* (BFC) Master Clock.*/
#define 	AT91C_BFC_BFCC_MCK_DIV_2            ((unsigned int) 0x2 <<  2) /* (BFC) Master Clock divided by 2.*/
#define 	AT91C_BFC_BFCC_MCK_DIV_4            ((unsigned int) 0x3 <<  2) /* (BFC) Master Clock divided by 4.*/
#define AT91C_BFC_AVL         ((unsigned int) 0xF <<  4) /* (BFC) Address Valid Latency*/
#define AT91C_BFC_PAGES       ((unsigned int) 0x7 <<  8) /* (BFC) Page Size*/
#define 	AT91C_BFC_PAGES_NO_PAGE              ((unsigned int) 0x0 <<  8) /* (BFC) No page handling.*/
#define 	AT91C_BFC_PAGES_16                   ((unsigned int) 0x1 <<  8) /* (BFC) 16 bytes page size.*/
#define 	AT91C_BFC_PAGES_32                   ((unsigned int) 0x2 <<  8) /* (BFC) 32 bytes page size.*/
#define 	AT91C_BFC_PAGES_64                   ((unsigned int) 0x3 <<  8) /* (BFC) 64 bytes page size.*/
#define 	AT91C_BFC_PAGES_128                  ((unsigned int) 0x4 <<  8) /* (BFC) 128 bytes page size.*/
#define 	AT91C_BFC_PAGES_256                  ((unsigned int) 0x5 <<  8) /* (BFC) 256 bytes page size.*/
#define 	AT91C_BFC_PAGES_512                  ((unsigned int) 0x6 <<  8) /* (BFC) 512 bytes page size.*/
#define 	AT91C_BFC_PAGES_1024                 ((unsigned int) 0x7 <<  8) /* (BFC) 1024 bytes page size.*/
#define AT91C_BFC_OEL         ((unsigned int) 0x3 << 12) /* (BFC) Output Enable Latency*/
#define AT91C_BFC_BAAEN       ((unsigned int) 0x1 << 16) /* (BFC) Burst Address Advance Enable*/
#define AT91C_BFC_BFOEH       ((unsigned int) 0x1 << 17) /* (BFC) Burst Flash Output Enable Handling*/
#define AT91C_BFC_MUXEN       ((unsigned int) 0x1 << 18) /* (BFC) Multiplexed Bus Enable*/
#define AT91C_BFC_RDYEN       ((unsigned int) 0x1 << 19) /* (BFC) Ready Enable Mode*/

