una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91rm9200.h
/* ******************************************************************************/
/*               REGISTER ADDRESS DEFINITION FOR AT91RM9200*/
/* ******************************************************************************/
/* ========== Register definition for SYS peripheral ========== */
/* ========== Register definition for MC peripheral ========== */
#define AT91C_MC_ASR    ((AT91_REG *) 	0xFFFFFF04) /* (MC) MC Abort Status Register*/
#define AT91C_MC_RCR    ((AT91_REG *) 	0xFFFFFF00) /* (MC) MC Remap Control Register*/
#define AT91C_MC_PUP    ((AT91_REG *) 	0xFFFFFF50) /* (MC) MC Protection Unit Peripherals*/
#define AT91C_MC_PUIA   ((AT91_REG *) 	0xFFFFFF10) /* (MC) MC Protection Unit Area*/
#define AT91C_MC_AASR   ((AT91_REG *) 	0xFFFFFF08) /* (MC) MC Abort Address Status Register*/
#define AT91C_MC_PUER   ((AT91_REG *) 	0xFFFFFF54) /* (MC) MC Protection Unit Enable Register*/
/* ========== Register definition for RTC peripheral ========== */
#define AT91C_RTC_VER   ((AT91_REG *) 	0xFFFFFE2C) /* (RTC) Valid Entry Register*/
#define AT91C_RTC_MR    ((AT91_REG *) 	0xFFFFFE04) /* (RTC) Mode Register*/
#define AT91C_RTC_IDR   ((AT91_REG *) 	0xFFFFFE24) /* (RTC) Interrupt Disable Register*/
#define AT91C_RTC_CALALR ((AT91_REG *) 	0xFFFFFE14) /* (RTC) Calendar Alarm Register*/
#define AT91C_RTC_IER   ((AT91_REG *) 	0xFFFFFE20) /* (RTC) Interrupt Enable Register*/
#define AT91C_RTC_TIMALR ((AT91_REG *) 	0xFFFFFE10) /* (RTC) Time Alarm Register*/
#define AT91C_RTC_IMR   ((AT91_REG *) 	0xFFFFFE28) /* (RTC) Interrupt Mask Register*/
#define AT91C_RTC_CR    ((AT91_REG *) 	0xFFFFFE00) /* (RTC) Control Register*/
#define AT91C_RTC_SCCR  ((AT91_REG *) 	0xFFFFFE1C) /* (RTC) Status Clear Command Register*/
#define AT91C_RTC_TIMR  ((AT91_REG *) 	0xFFFFFE08) /* (RTC) Time Register*/
#define AT91C_RTC_SR    ((AT91_REG *) 	0xFFFFFE18) /* (RTC) Status Register*/
#define AT91C_RTC_CALR  ((AT91_REG *) 	0xFFFFFE0C) /* (RTC) Calendar Register*/
/* ========== Register definition for ST peripheral ========== */
#define AT91C_ST_CR     ((AT91_REG *) 	0xFFFFFD00) /* (ST) Control Register*/
#define AT91C_ST_RTAR   ((AT91_REG *) 	0xFFFFFD20) /* (ST) Real-time Alarm Register*/
#define AT91C_ST_IDR    ((AT91_REG *) 	0xFFFFFD18) /* (ST) Interrupt Disable Register*/
#define AT91C_ST_PIMR   ((AT91_REG *) 	0xFFFFFD04) /* (ST) Period Interval Mode Register*/
#define AT91C_ST_IER    ((AT91_REG *) 	0xFFFFFD14) /* (ST) Interrupt Enable Register*/
#define AT91C_ST_CRTR   ((AT91_REG *) 	0xFFFFFD24) /* (ST) Current Real-time Register*/
#define AT91C_ST_WDMR   ((AT91_REG *) 	0xFFFFFD08) /* (ST) Watchdog Mode Register*/
#define AT91C_ST_SR     ((AT91_REG *) 	0xFFFFFD10) /* (ST) Status Register*/
#define AT91C_ST_RTMR   ((AT91_REG *) 	0xFFFFFD0C) /* (ST) Real-time Mode Register*/
#define AT91C_ST_IMR    ((AT91_REG *) 	0xFFFFFD1C) /* (ST) Interrupt Mask Register*/
/* ========== Register definition for PMC peripheral ========== */
#define AT91C_PMC_IDR   ((AT91_REG *) 	0xFFFFFC64) /* (PMC) Interrupt Disable Register*/
#define AT91C_PMC_PCER  ((AT91_REG *) 	0xFFFFFC10) /* (PMC) Peripheral Clock Enable Register*/
#define AT91C_PMC_PCKR  ((AT91_REG *) 	0xFFFFFC40) /* (PMC) Programmable Clock Register*/
#define AT91C_PMC_MCKR  ((AT91_REG *) 	0xFFFFFC30) /* (PMC) Master Clock Register*/
#define AT91C_PMC_SCDR  ((AT91_REG *) 	0xFFFFFC04) /* (PMC) System Clock Disable Register*/
#define AT91C_PMC_PCDR  ((AT91_REG *) 	0xFFFFFC14) /* (PMC) Peripheral Clock Disable Register*/
#define AT91C_PMC_SCSR  ((AT91_REG *) 	0xFFFFFC08) /* (PMC) System Clock Status Register*/
#define AT91C_PMC_PCSR  ((AT91_REG *) 	0xFFFFFC18) /* (PMC) Peripheral Clock Status Register*/
#define AT91C_PMC_SCER  ((AT91_REG *) 	0xFFFFFC00) /* (PMC) System Clock Enable Register*/
#define AT91C_PMC_IMR   ((AT91_REG *) 	0xFFFFFC6C) /* (PMC) Interrupt Mask Register*/
#define AT91C_PMC_IER   ((AT91_REG *) 	0xFFFFFC60) /* (PMC) Interrupt Enable Register*/
#define AT91C_PMC_SR    ((AT91_REG *) 	0xFFFFFC68) /* (PMC) Status Register*/
/* ========== Register definition for CKGR peripheral ========== */
#define AT91C_CKGR_MOR  ((AT91_REG *) 	0xFFFFFC20) /* (CKGR) Main Oscillator Register*/
#define AT91C_CKGR_PLLBR ((AT91_REG *) 	0xFFFFFC2C) /* (CKGR) PLL B Register*/
#define AT91C_CKGR_MCFR ((AT91_REG *) 	0xFFFFFC24) /* (CKGR) Main Clock  Frequency Register*/
#define AT91C_CKGR_PLLAR ((AT91_REG *) 	0xFFFFFC28) /* (CKGR) PLL A Register*/
/* ========== Register definition for PIOD peripheral ========== */
#define AT91C_PIOD_ODSR ((AT91_REG *) 	0xFFFFFA38) /* (PIOD) Output Data Status Register*/
#define AT91C_PIOD_ABSR ((AT91_REG *) 	0xFFFFFA78) /* (PIOD) AB Select Status Register*/
#define AT91C_PIOD_PSR  ((AT91_REG *) 	0xFFFFFA08) /* (PIOD) PIO Status Register*/
#define AT91C_PIOD_PPUDR ((AT91_REG *) 	0xFFFFFA60) /* (PIOD) Pull-up Disable Register*/
#define AT91C_PIOD_OER  ((AT91_REG *) 	0xFFFFFA10) /* (PIOD) Output Enable Register*/
#define AT91C_PIOD_OWDR ((AT91_REG *) 	0xFFFFFAA4) /* (PIOD) Output Write Disable Register*/
#define AT91C_PIOD_PER  ((AT91_REG *) 	0xFFFFFA00) /* (PIOD) PIO Enable Register*/
#define AT91C_PIOD_IFSR ((AT91_REG *) 	0xFFFFFA28) /* (PIOD) Input Filter Status Register*/
#define AT91C_PIOD_IFER ((AT91_REG *) 	0xFFFFFA20) /* (PIOD) Input Filter Enable Register*/
#define AT91C_PIOD_ODR  ((AT91_REG *) 	0xFFFFFA14) /* (PIOD) Output Disable Registerr*/
#define AT91C_PIOD_PPUSR ((AT91_REG *) 	0xFFFFFA68) /* (PIOD) Pad Pull-up Status Register*/
#define AT91C_PIOD_IFDR ((AT91_REG *) 	0xFFFFFA24) /* (PIOD) Input Filter Disable Register*/
#define AT91C_PIOD_PDSR ((AT91_REG *) 	0xFFFFFA3C) /* (PIOD) Pin Data Status Register*/
#define AT91C_PIOD_PPUER ((AT91_REG *) 	0xFFFFFA64) /* (PIOD) Pull-up Enable Register*/
#define AT91C_PIOD_IDR  ((AT91_REG *) 	0xFFFFFA44) /* (PIOD) Interrupt Disable Register*/
#define AT91C_PIOD_MDDR ((AT91_REG *) 	0xFFFFFA54) /* (PIOD) Multi-driver Disable Register*/
#define AT91C_PIOD_ISR  ((AT91_REG *) 	0xFFFFFA4C) /* (PIOD) Interrupt Status Register*/
#define AT91C_PIOD_OSR  ((AT91_REG *) 	0xFFFFFA18) /* (PIOD) Output Status Register*/
#define AT91C_PIOD_CODR ((AT91_REG *) 	0xFFFFFA34) /* (PIOD) Clear Output Data Register*/
#define AT91C_PIOD_MDSR ((AT91_REG *) 	0xFFFFFA58) /* (PIOD) Multi-driver Status Register*/
#define AT91C_PIOD_PDR  ((AT91_REG *) 	0xFFFFFA04) /* (PIOD) PIO Disable Register*/
#define AT91C_PIOD_IER  ((AT91_REG *) 	0xFFFFFA40) /* (PIOD) Interrupt Enable Register*/
#define AT91C_PIOD_OWSR ((AT91_REG *) 	0xFFFFFAA8) /* (PIOD) Output Write Status Register*/
#define AT91C_PIOD_BSR  ((AT91_REG *) 	0xFFFFFA74) /* (PIOD) Select B Register*/
#define AT91C_PIOD_ASR  ((AT91_REG *) 	0xFFFFFA70) /* (PIOD) Select A Register*/
#define AT91C_PIOD_SODR ((AT91_REG *) 	0xFFFFFA30) /* (PIOD) Set Output Data Register*/
#define AT91C_PIOD_IMR  ((AT91_REG *) 	0xFFFFFA48) /* (PIOD) Interrupt Mask Register*/
#define AT91C_PIOD_OWER ((AT91_REG *) 	0xFFFFFAA0) /* (PIOD) Output Write Enable Register*/
#define AT91C_PIOD_MDER ((AT91_REG *) 	0xFFFFFA50) /* (PIOD) Multi-driver Enable Register*/
/* ========== Register definition for PIOC peripheral ========== */
#define AT91C_PIOC_OWDR ((AT91_REG *) 	0xFFFFF8A4) /* (PIOC) Output Write Disable Register*/
#define AT91C_PIOC_SODR ((AT91_REG *) 	0xFFFFF830) /* (PIOC) Set Output Data Register*/
#define AT91C_PIOC_PPUER ((AT91_REG *) 	0xFFFFF864) /* (PIOC) Pull-up Enable Register*/
#define AT91C_PIOC_CODR ((AT91_REG *) 	0xFFFFF834) /* (PIOC) Clear Output Data Register*/
#define AT91C_PIOC_PSR  ((AT91_REG *) 	0xFFFFF808) /* (PIOC) PIO Status Register*/
#define AT91C_PIOC_PDR  ((AT91_REG *) 	0xFFFFF804) /* (PIOC) PIO Disable Register*/
#define AT91C_PIOC_ODR  ((AT91_REG *) 	0xFFFFF814) /* (PIOC) Output Disable Registerr*/
#define AT91C_PIOC_PPUSR ((AT91_REG *) 	0xFFFFF868) /* (PIOC) Pad Pull-up Status Register*/
#define AT91C_PIOC_ABSR ((AT91_REG *) 	0xFFFFF878) /* (PIOC) AB Select Status Register*/
#define AT91C_PIOC_IFSR ((AT91_REG *) 	0xFFFFF828) /* (PIOC) Input Filter Status Register*/
#define AT91C_PIOC_OER  ((AT91_REG *) 	0xFFFFF810) /* (PIOC) Output Enable Register*/
#define AT91C_PIOC_IMR  ((AT91_REG *) 	0xFFFFF848) /* (PIOC) Interrupt Mask Register*/
#define AT91C_PIOC_ASR  ((AT91_REG *) 	0xFFFFF870) /* (PIOC) Select A Register*/
#define AT91C_PIOC_MDDR ((AT91_REG *) 	0xFFFFF854) /* (PIOC) Multi-driver Disable Register*/
#define AT91C_PIOC_OWSR ((AT91_REG *) 	0xFFFFF8A8) /* (PIOC) Output Write Status Register*/
#define AT91C_PIOC_PER  ((AT91_REG *) 	0xFFFFF800) /* (PIOC) PIO Enable Register*/
#define AT91C_PIOC_IDR  ((AT91_REG *) 	0xFFFFF844) /* (PIOC) Interrupt Disable Register*/
#define AT91C_PIOC_MDER ((AT91_REG *) 	0xFFFFF850) /* (PIOC) Multi-driver Enable Register*/
#define AT91C_PIOC_PDSR ((AT91_REG *) 	0xFFFFF83C) /* (PIOC) Pin Data Status Register*/
#define AT91C_PIOC_MDSR ((AT91_REG *) 	0xFFFFF858) /* (PIOC) Multi-driver Status Register*/
#define AT91C_PIOC_OWER ((AT91_REG *) 	0xFFFFF8A0) /* (PIOC) Output Write Enable Register*/
#define AT91C_PIOC_BSR  ((AT91_REG *) 	0xFFFFF874) /* (PIOC) Select B Register*/
#define AT91C_PIOC_PPUDR ((AT91_REG *) 	0xFFFFF860) /* (PIOC) Pull-up Disable Register*/
#define AT91C_PIOC_IFDR ((AT91_REG *) 	0xFFFFF824) /* (PIOC) Input Filter Disable Register*/
#define AT91C_PIOC_IER  ((AT91_REG *) 	0xFFFFF840) /* (PIOC) Interrupt Enable Register*/
#define AT91C_PIOC_OSR  ((AT91_REG *) 	0xFFFFF818) /* (PIOC) Output Status Register*/
#define AT91C_PIOC_ODSR ((AT91_REG *) 	0xFFFFF838) /* (PIOC) Output Data Status Register*/
#define AT91C_PIOC_ISR  ((AT91_REG *) 	0xFFFFF84C) /* (PIOC) Interrupt Status Register*/
#define AT91C_PIOC_IFER ((AT91_REG *) 	0xFFFFF820) /* (PIOC) Input Filter Enable Register*/
/* ========== Register definition for PIOB peripheral ========== */
#define AT91C_PIOB_OWDR ((AT91_REG *) 	0xFFFFF6A4) /* (PIOB) Output Write Disable Register*/
#define AT91C_PIOB_MDER ((AT91_REG *) 	0xFFFFF650) /* (PIOB) Multi-driver Enable Register*/
#define AT91C_PIOB_PPUSR ((AT91_REG *) 	0xFFFFF668) /* (PIOB) Pad Pull-up Status Register*/
#define AT91C_PIOB_IMR  ((AT91_REG *) 	0xFFFFF648) /* (PIOB) Interrupt Mask Register*/
#define AT91C_PIOB_ASR  ((AT91_REG *) 	0xFFFFF670) /* (PIOB) Select A Register*/
#define AT91C_PIOB_PPUDR ((AT91_REG *) 	0xFFFFF660) /* (PIOB) Pull-up Disable Register*/
#define AT91C_PIOB_PSR  ((AT91_REG *) 	0xFFFFF608) /* (PIOB) PIO Status Register*/
#define AT91C_PIOB_IER  ((AT91_REG *) 	0xFFFFF640) /* (PIOB) Interrupt Enable Register*/
#define AT91C_PIOB_CODR ((AT91_REG *) 	0xFFFFF634) /* (PIOB) Clear Output Data Register*/
#define AT91C_PIOB_OWER ((AT91_REG *) 	0xFFFFF6A0) /* (PIOB) Output Write Enable Register*/
#define AT91C_PIOB_ABSR ((AT91_REG *) 	0xFFFFF678) /* (PIOB) AB Select Status Register*/
#define AT91C_PIOB_IFDR ((AT91_REG *) 	0xFFFFF624) /* (PIOB) Input Filter Disable Register*/
#define AT91C_PIOB_PDSR ((AT91_REG *) 	0xFFFFF63C) /* (PIOB) Pin Data Status Register*/
#define AT91C_PIOB_IDR  ((AT91_REG *) 	0xFFFFF644) /* (PIOB) Interrupt Disable Register*/
#define AT91C_PIOB_OWSR ((AT91_REG *) 	0xFFFFF6A8) /* (PIOB) Output Write Status Register*/
#define AT91C_PIOB_PDR  ((AT91_REG *) 	0xFFFFF604) /* (PIOB) PIO Disable Register*/
#define AT91C_PIOB_ODR  ((AT91_REG *) 	0xFFFFF614) /* (PIOB) Output Disable Registerr*/
#define AT91C_PIOB_IFSR ((AT91_REG *) 	0xFFFFF628) /* (PIOB) Input Filter Status Register*/
#define AT91C_PIOB_PPUER ((AT91_REG *) 	0xFFFFF664) /* (PIOB) Pull-up Enable Register*/
#define AT91C_PIOB_SODR ((AT91_REG *) 	0xFFFFF630) /* (PIOB) Set Output Data Register*/
#define AT91C_PIOB_ISR  ((AT91_REG *) 	0xFFFFF64C) /* (PIOB) Interrupt Status Register*/
#define AT91C_PIOB_ODSR ((AT91_REG *) 	0xFFFFF638) /* (PIOB) Output Data Status Register*/
#define AT91C_PIOB_OSR  ((AT91_REG *) 	0xFFFFF618) /* (PIOB) Output Status Register*/
#define AT91C_PIOB_MDSR ((AT91_REG *) 	0xFFFFF658) /* (PIOB) Multi-driver Status Register*/
#define AT91C_PIOB_IFER ((AT91_REG *) 	0xFFFFF620) /* (PIOB) Input Filter Enable Register*/
#define AT91C_PIOB_BSR  ((AT91_REG *) 	0xFFFFF674) /* (PIOB) Select B Register*/
#define AT91C_PIOB_MDDR ((AT91_REG *) 	0xFFFFF654) /* (PIOB) Multi-driver Disable Register*/
#define AT91C_PIOB_OER  ((AT91_REG *) 	0xFFFFF610) /* (PIOB) Output Enable Register*/
#define AT91C_PIOB_PER  ((AT91_REG *) 	0xFFFFF600) /* (PIOB) PIO Enable Register*/
/* ========== Register definition for PIOA peripheral ========== */
#define AT91C_PIOA_ODR  ((AT91_REG *) 	0xFFFFF414) /* (PIOA) Output Disable Registerr*/
#define AT91C_PIOA_SODR ((AT91_REG *) 	0xFFFFF430) /* (PIOA) Set Output Data Register*/
#define AT91C_PIOA_ISR  ((AT91_REG *) 	0xFFFFF44C) /* (PIOA) Interrupt Status Register*/
#define AT91C_PIOA_ABSR ((AT91_REG *) 	0xFFFFF478) /* (PIOA) AB Select Status Register*/
#define AT91C_PIOA_IER  ((AT91_REG *) 	0xFFFFF440) /* (PIOA) Interrupt Enable Register*/
#define AT91C_PIOA_PPUDR ((AT91_REG *) 	0xFFFFF460) /* (PIOA) Pull-up Disable Register*/
#define AT91C_PIOA_IMR  ((AT91_REG *) 	0xFFFFF448) /* (PIOA) Interrupt Mask Register*/
#define AT91C_PIOA_PER  ((AT91_REG *) 	0xFFFFF400) /* (PIOA) PIO Enable Register*/
#define AT91C_PIOA_IFDR ((AT91_REG *) 	0xFFFFF424) /* (PIOA) Input Filter Disable Register*/
#define AT91C_PIOA_OWDR ((AT91_REG *) 	0xFFFFF4A4) /* (PIOA) Output Write Disable Register*/
#define AT91C_PIOA_MDSR ((AT91_REG *) 	0xFFFFF458) /* (PIOA) Multi-driver Status Register*/
#define AT91C_PIOA_IDR  ((AT91_REG *) 	0xFFFFF444) /* (PIOA) Interrupt Disable Register*/
#define AT91C_PIOA_ODSR ((AT91_REG *) 	0xFFFFF438) /* (PIOA) Output Data Status Register*/
#define AT91C_PIOA_PPUSR ((AT91_REG *) 	0xFFFFF468) /* (PIOA) Pad Pull-up Status Register*/
#define AT91C_PIOA_OWSR ((AT91_REG *) 	0xFFFFF4A8) /* (PIOA) Output Write Status Register*/
#define AT91C_PIOA_BSR  ((AT91_REG *) 	0xFFFFF474) /* (PIOA) Select B Register*/
#define AT91C_PIOA_OWER ((AT91_REG *) 	0xFFFFF4A0) /* (PIOA) Output Write Enable Register*/
#define AT91C_PIOA_IFER ((AT91_REG *) 	0xFFFFF420) /* (PIOA) Input Filter Enable Register*/
#define AT91C_PIOA_PDSR ((AT91_REG *) 	0xFFFFF43C) /* (PIOA) Pin Data Status Register*/
#define AT91C_PIOA_PPUER ((AT91_REG *) 	0xFFFFF464) /* (PIOA) Pull-up Enable Register*/
#define AT91C_PIOA_OSR  ((AT91_REG *) 	0xFFFFF418) /* (PIOA) Output Status Register*/
#define AT91C_PIOA_ASR  ((AT91_REG *) 	0xFFFFF470) /* (PIOA) Select A Register*/
#define AT91C_PIOA_MDDR ((AT91_REG *) 	0xFFFFF454) /* (PIOA) Multi-driver Disable Register*/
#define AT91C_PIOA_CODR ((AT91_REG *) 	0xFFFFF434) /* (PIOA) Clear Output Data Register*/
#define AT91C_PIOA_MDER ((AT91_REG *) 	0xFFFFF450) /* (PIOA) Multi-driver Enable Register*/
#define AT91C_PIOA_PDR  ((AT91_REG *) 	0xFFFFF404) /* (PIOA) PIO Disable Register*/
#define AT91C_PIOA_IFSR ((AT91_REG *) 	0xFFFFF428) /* (PIOA) Input Filter Status Register*/
#define AT91C_PIOA_OER  ((AT91_REG *) 	0xFFFFF410) /* (PIOA) Output Enable Register*/
#define AT91C_PIOA_PSR  ((AT91_REG *) 	0xFFFFF408) /* (PIOA) PIO Status Register*/
/* ========== Register definition for DBGU peripheral ========== */
#define AT91C_DBGU_C2R  ((AT91_REG *) 	0xFFFFF244) /* (DBGU) Chip ID2 Register*/
#define AT91C_DBGU_BRGR ((AT91_REG *) 	0xFFFFF220) /* (DBGU) Baud Rate Generator Register*/
#define AT91C_DBGU_IDR  ((AT91_REG *) 	0xFFFFF20C) /* (DBGU) Interrupt Disable Register*/
#define AT91C_DBGU_CSR  ((AT91_REG *) 	0xFFFFF214) /* (DBGU) Channel Status Register*/
#define AT91C_DBGU_C1R  ((AT91_REG *) 	0xFFFFF240) /* (DBGU) Chip ID1 Register*/
#define AT91C_DBGU_MR   ((AT91_REG *) 	0xFFFFF204) /* (DBGU) Mode Register*/
#define AT91C_DBGU_IMR  ((AT91_REG *) 	0xFFFFF210) /* (DBGU) Interrupt Mask Register*/
#define AT91C_DBGU_CR   ((AT91_REG *) 	0xFFFFF200) /* (DBGU) Control Register*/
#define AT91C_DBGU_FNTR ((AT91_REG *) 	0xFFFFF248) /* (DBGU) Force NTRST Register*/
#define AT91C_DBGU_THR  ((AT91_REG *) 	0xFFFFF21C) /* (DBGU) Transmitter Holding Register*/
#define AT91C_DBGU_RHR  ((AT91_REG *) 	0xFFFFF218) /* (DBGU) Receiver Holding Register*/
#define AT91C_DBGU_IER  ((AT91_REG *) 	0xFFFFF208) /* (DBGU) Interrupt Enable Register*/
/* ========== Register definition for PDC_DBGU peripheral ========== */
#define AT91C_DBGU_TCR  ((AT91_REG *) 	0xFFFFF30C) /* (PDC_DBGU) Transmit Counter Register*/
#define AT91C_DBGU_RNPR ((AT91_REG *) 	0xFFFFF310) /* (PDC_DBGU) Receive Next Pointer Register*/
#define AT91C_DBGU_TNPR ((AT91_REG *) 	0xFFFFF318) /* (PDC_DBGU) Transmit Next Pointer Register*/
#define AT91C_DBGU_TPR  ((AT91_REG *) 	0xFFFFF308) /* (PDC_DBGU) Transmit Pointer Register*/
#define AT91C_DBGU_RPR  ((AT91_REG *) 	0xFFFFF300) /* (PDC_DBGU) Receive Pointer Register*/
#define AT91C_DBGU_RCR  ((AT91_REG *) 	0xFFFFF304) /* (PDC_DBGU) Receive Counter Register*/
#define AT91C_DBGU_RNCR ((AT91_REG *) 	0xFFFFF314) /* (PDC_DBGU) Receive Next Counter Register*/
#define AT91C_DBGU_PTCR ((AT91_REG *) 	0xFFFFF320) /* (PDC_DBGU) PDC Transfer Control Register*/
#define AT91C_DBGU_PTSR ((AT91_REG *) 	0xFFFFF324) /* (PDC_DBGU) PDC Transfer Status Register*/
#define AT91C_DBGU_TNCR ((AT91_REG *) 	0xFFFFF31C) /* (PDC_DBGU) Transmit Next Counter Register*/
/* ========== Register definition for AIC peripheral ========== */
#define AT91C_AIC_IVR   ((AT91_REG *) 	0xFFFFF100) /* (AIC) IRQ Vector Register*/
#define AT91C_AIC_SMR   ((AT91_REG *) 	0xFFFFF000) /* (AIC) Source Mode Register*/
#define AT91C_AIC_FVR   ((AT91_REG *) 	0xFFFFF104) /* (AIC) FIQ Vector Register*/
#define AT91C_AIC_DCR   ((AT91_REG *) 	0xFFFFF138) /* (AIC) Debug Control Register (Protect)*/
#define AT91C_AIC_EOICR ((AT91_REG *) 	0xFFFFF130) /* (AIC) End of Interrupt Command Register*/
#define AT91C_AIC_SVR   ((AT91_REG *) 	0xFFFFF080) /* (AIC) Source Vector Register*/
#define AT91C_AIC_FFSR  ((AT91_REG *) 	0xFFFFF148) /* (AIC) Fast Forcing Status Register*/
#define AT91C_AIC_ICCR  ((AT91_REG *) 	0xFFFFF128) /* (AIC) Interrupt Clear Command Register*/
#define AT91C_AIC_ISR   ((AT91_REG *) 	0xFFFFF108) /* (AIC) Interrupt Status Register*/
#define AT91C_AIC_IMR   ((AT91_REG *) 	0xFFFFF110) /* (AIC) Interrupt Mask Register*/
#define AT91C_AIC_IPR   ((AT91_REG *) 	0xFFFFF10C) /* (AIC) Interrupt Pending Register*/
#define AT91C_AIC_FFER  ((AT91_REG *) 	0xFFFFF140) /* (AIC) Fast Forcing Enable Register*/
#define AT91C_AIC_IECR  ((AT91_REG *) 	0xFFFFF120) /* (AIC) Interrupt Enable Command Register*/
#define AT91C_AIC_ISCR  ((AT91_REG *) 	0xFFFFF12C) /* (AIC) Interrupt Set Command Register*/
#define AT91C_AIC_FFDR  ((AT91_REG *) 	0xFFFFF144) /* (AIC) Fast Forcing Disable Register*/
#define AT91C_AIC_CISR  ((AT91_REG *) 	0xFFFFF114) /* (AIC) Core Interrupt Status Register*/
#define AT91C_AIC_IDCR  ((AT91_REG *) 	0xFFFFF124) /* (AIC) Interrupt Disable Command Register*/
#define AT91C_AIC_SPU   ((AT91_REG *) 	0xFFFFF134) /* (AIC) Spurious Vector Register*/
/* ========== Register definition for PDC_SPI peripheral ========== */
#define AT91C_SPI_PTCR  ((AT91_REG *) 	0xFFFE0120) /* (PDC_SPI) PDC Transfer Control Register*/
#define AT91C_SPI_TPR   ((AT91_REG *) 	0xFFFE0108) /* (PDC_SPI) Transmit Pointer Register*/
#define AT91C_SPI_TCR   ((AT91_REG *) 	0xFFFE010C) /* (PDC_SPI) Transmit Counter Register*/
#define AT91C_SPI_RCR   ((AT91_REG *) 	0xFFFE0104) /* (PDC_SPI) Receive Counter Register*/
#define AT91C_SPI_PTSR  ((AT91_REG *) 	0xFFFE0124) /* (PDC_SPI) PDC Transfer Status Register*/
#define AT91C_SPI_RNPR  ((AT91_REG *) 	0xFFFE0110) /* (PDC_SPI) Receive Next Pointer Register*/
#define AT91C_SPI_RPR   ((AT91_REG *) 	0xFFFE0100) /* (PDC_SPI) Receive Pointer Register*/
#define AT91C_SPI_TNCR  ((AT91_REG *) 	0xFFFE011C) /* (PDC_SPI) Transmit Next Counter Register*/
#define AT91C_SPI_RNCR  ((AT91_REG *) 	0xFFFE0114) /* (PDC_SPI) Receive Next Counter Register*/
#define AT91C_SPI_TNPR  ((AT91_REG *) 	0xFFFE0118) /* (PDC_SPI) Transmit Next Pointer Register*/
/* ========== Register definition for SPI peripheral ========== */
#define AT91C_SPI_IER   ((AT91_REG *) 	0xFFFE0014) /* (SPI) Interrupt Enable Register*/
#define AT91C_SPI_SR    ((AT91_REG *) 	0xFFFE0010) /* (SPI) Status Register*/
#define AT91C_SPI_IDR   ((AT91_REG *) 	0xFFFE0018) /* (SPI) Interrupt Disable Register*/
#define AT91C_SPI_CR    ((AT91_REG *) 	0xFFFE0000) /* (SPI) Control Register*/
#define AT91C_SPI_MR    ((AT91_REG *) 	0xFFFE0004) /* (SPI) Mode Register*/
#define AT91C_SPI_IMR   ((AT91_REG *) 	0xFFFE001C) /* (SPI) Interrupt Mask Register*/
#define AT91C_SPI_TDR   ((AT91_REG *) 	0xFFFE000C) /* (SPI) Transmit Data Register*/
#define AT91C_SPI_RDR   ((AT91_REG *) 	0xFFFE0008) /* (SPI) Receive Data Register*/
#define AT91C_SPI_CSR   ((AT91_REG *) 	0xFFFE0030) /* (SPI) Chip Select Register*/
/* ========== Register definition for PDC_SSC2 peripheral ========== */
#define AT91C_SSC2_PTSR ((AT91_REG *) 	0xFFFD8124) /* (PDC_SSC2) PDC Transfer Status Register*/
#define AT91C_SSC2_PTCR ((AT91_REG *) 	0xFFFD8120) /* (PDC_SSC2) PDC Transfer Control Register*/
#define AT91C_SSC2_TNPR ((AT91_REG *) 	0xFFFD8118) /* (PDC_SSC2) Transmit Next Pointer Register*/
#define AT91C_SSC2_TNCR ((AT91_REG *) 	0xFFFD811C) /* (PDC_SSC2) Transmit Next Counter Register*/
#define AT91C_SSC2_RNPR ((AT91_REG *) 	0xFFFD8110) /* (PDC_SSC2) Receive Next Pointer Register*/
#define AT91C_SSC2_RNCR ((AT91_REG *) 	0xFFFD8114) /* (PDC_SSC2) Receive Next Counter Register*/
#define AT91C_SSC2_RPR  ((AT91_REG *) 	0xFFFD8100) /* (PDC_SSC2) Receive Pointer Register*/
#define AT91C_SSC2_TCR  ((AT91_REG *) 	0xFFFD810C) /* (PDC_SSC2) Transmit Counter Register*/
#define AT91C_SSC2_TPR  ((AT91_REG *) 	0xFFFD8108) /* (PDC_SSC2) Transmit Pointer Register*/
#define AT91C_SSC2_RCR  ((AT91_REG *) 	0xFFFD8104) /* (PDC_SSC2) Receive Counter Register*/
/* ========== Register definition for SSC2 peripheral ========== */
#define AT91C_SSC2_RC0R ((AT91_REG *) 	0xFFFD8038) /* (SSC2) Receive Compare 0 Register*/
#define AT91C_SSC2_RC1R ((AT91_REG *) 	0xFFFD803C) /* (SSC2) Receive Compare 1 Register*/
#define AT91C_SSC2_RSHR ((AT91_REG *) 	0xFFFD8030) /* (SSC2) Receive Sync Holding Register*/
#define AT91C_SSC2_IER  ((AT91_REG *) 	0xFFFD8044) /* (SSC2) Interrupt Enable Register*/
#define AT91C_SSC2_RFMR ((AT91_REG *) 	0xFFFD8014) /* (SSC2) Receive Frame Mode Register*/
#define AT91C_SSC2_TFMR ((AT91_REG *) 	0xFFFD801C) /* (SSC2) Transmit Frame Mode Register*/
#define AT91C_SSC2_SR   ((AT91_REG *) 	0xFFFD8040) /* (SSC2) Status Register*/
#define AT91C_SSC2_TSHR ((AT91_REG *) 	0xFFFD8034) /* (SSC2) Transmit Sync Holding Register*/
#define AT91C_SSC2_RHR  ((AT91_REG *) 	0xFFFD8020) /* (SSC2) Receive Holding Register*/
#define AT91C_SSC2_CR   ((AT91_REG *) 	0xFFFD8000) /* (SSC2) Control Register*/
#define AT91C_SSC2_IDR  ((AT91_REG *) 	0xFFFD8048) /* (SSC2) Interrupt Disable Register*/
#define AT91C_SSC2_IMR  ((AT91_REG *) 	0xFFFD804C) /* (SSC2) Interrupt Mask Register*/
#define AT91C_SSC2_THR  ((AT91_REG *) 	0xFFFD8024) /* (SSC2) Transmit Holding Register*/
#define AT91C_SSC2_RCMR ((AT91_REG *) 	0xFFFD8010) /* (SSC2) Receive Clock ModeRegister*/
#define AT91C_SSC2_TCMR ((AT91_REG *) 	0xFFFD8018) /* (SSC2) Transmit Clock Mode Register*/
#define AT91C_SSC2_CMR  ((AT91_REG *) 	0xFFFD8004) /* (SSC2) Clock Mode Register*/
/* ========== Register definition for PDC_SSC1 peripheral ========== */
#define AT91C_SSC1_TNCR ((AT91_REG *) 	0xFFFD411C) /* (PDC_SSC1) Transmit Next Counter Register*/
#define AT91C_SSC1_RPR  ((AT91_REG *) 	0xFFFD4100) /* (PDC_SSC1) Receive Pointer Register*/
#define AT91C_SSC1_RNCR ((AT91_REG *) 	0xFFFD4114) /* (PDC_SSC1) Receive Next Counter Register*/
#define AT91C_SSC1_TPR  ((AT91_REG *) 	0xFFFD4108) /* (PDC_SSC1) Transmit Pointer Register*/
#define AT91C_SSC1_PTCR ((AT91_REG *) 	0xFFFD4120) /* (PDC_SSC1) PDC Transfer Control Register*/
