una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91rm9200.h
#define AT91C_TC0_CV    ((AT91_REG *) 	0xFFFA0010) /* (TC0) Counter Value*/
#define AT91C_TC0_IMR   ((AT91_REG *) 	0xFFFA002C) /* (TC0) Interrupt Mask Register*/
/* ========== Register definition for TCB0 peripheral ========== */
#define AT91C_TCB0_BMR  ((AT91_REG *) 	0xFFFA00C4) /* (TCB0) TC Block Mode Register*/
#define AT91C_TCB0_BCR  ((AT91_REG *) 	0xFFFA00C0) /* (TCB0) TC Block Control Register*/
/* ========== Register definition for UHP peripheral ========== */
#define AT91C_UHP_HcFmInterval ((AT91_REG *) 	0x00300034) /* (UHP) Bit time between 2 consecutive SOFs*/
#define AT91C_UHP_HcCommandStatus ((AT91_REG *) 	0x00300008) /* (UHP) Command & status Register*/
#define AT91C_UHP_HcControlCurrentED ((AT91_REG *) 	0x00300024) /* (UHP) Endpoint Control and Status Register*/
#define AT91C_UHP_HcInterruptStatus ((AT91_REG *) 	0x0030000C) /* (UHP) Interrupt Status Register*/
#define AT91C_UHP_HcPeriodicStart ((AT91_REG *) 	0x00300040) /* (UHP) Periodic Start*/
#define AT91C_UHP_HcBulkCurrentED ((AT91_REG *) 	0x0030002C) /* (UHP) Current endpoint of the Bulk list*/
#define AT91C_UHP_HcInterruptDisable ((AT91_REG *) 	0x00300014) /* (UHP) Interrupt Disable Register*/
#define AT91C_UHP_HcRhStatus ((AT91_REG *) 	0x00300050) /* (UHP) Root Hub Status register*/
#define AT91C_UHP_HcFmRemaining ((AT91_REG *) 	0x00300038) /* (UHP) Bit time remaining in the current Frame*/
#define AT91C_UHP_HcBulkHeadED ((AT91_REG *) 	0x00300028) /* (UHP) First endpoint register of the Bulk list*/
#define AT91C_UHP_HcPeriodCurrentED ((AT91_REG *) 	0x0030001C) /* (UHP) Current Isochronous or Interrupt Endpoint Descriptor*/
#define AT91C_UHP_HcControlHeadED ((AT91_REG *) 	0x00300020) /* (UHP) First Endpoint Descriptor of the Control list*/
#define AT91C_UHP_HcInterruptEnable ((AT91_REG *) 	0x00300010) /* (UHP) Interrupt Enable Register*/
#define AT91C_UHP_HcRhDescriptorA ((AT91_REG *) 	0x00300048) /* (UHP) Root Hub characteristics A*/
#define AT91C_UHP_HcBulkDoneHead ((AT91_REG *) 	0x00300030) /* (UHP) Last completed transfer descriptor*/
#define AT91C_UHP_HcRevision ((AT91_REG *) 	0x00300000) /* (UHP) Revision*/
#define AT91C_UHP_HcLSThreshold ((AT91_REG *) 	0x00300044) /* (UHP) LS Threshold*/
#define AT91C_UHP_HcRhPortStatus ((AT91_REG *) 	0x00300054) /* (UHP) Root Hub Port Status Register*/
#define AT91C_UHP_HcRhDescriptorB ((AT91_REG *) 	0x0030004C) /* (UHP) Root Hub characteristics B*/
#define AT91C_UHP_HcHCCA ((AT91_REG *) 	0x00300018) /* (UHP) Pointer to the Host Controller Communication Area*/
#define AT91C_UHP_HcControl ((AT91_REG *) 	0x00300004) /* (UHP) Operating modes for the Host Controller*/
#define AT91C_UHP_HcFmNumber ((AT91_REG *) 	0x0030003C) /* (UHP) Frame number*/
/* ========== Register definition for EMAC peripheral ========== */
#define AT91C_EMAC_ALE  ((AT91_REG *) 	0xFFFBC054) /* (EMAC) Alignment Error Register*/
#define AT91C_EMAC_CDE  ((AT91_REG *) 	0xFFFBC06C) /* (EMAC) Code Error Register*/
#define AT91C_EMAC_SA4H ((AT91_REG *) 	0xFFFBC0B4) /* (EMAC) Specific Address 4 High, Last 2 bytesr*/
#define AT91C_EMAC_SQEE ((AT91_REG *) 	0xFFFBC07C) /* (EMAC) SQE Test Error Register*/
#define AT91C_EMAC_SA2H ((AT91_REG *) 	0xFFFBC0A4) /* (EMAC) Specific Address 2 High, Last 2 bytes*/
#define AT91C_EMAC_ELR  ((AT91_REG *) 	0xFFFBC070) /* (EMAC) Excessive Length Error Register*/
#define AT91C_EMAC_SA4L ((AT91_REG *) 	0xFFFBC0B0) /* (EMAC) Specific Address 4 Low, First 4 bytes*/
#define AT91C_EMAC_MAN  ((AT91_REG *) 	0xFFFBC034) /* (EMAC) PHY Maintenance Register*/
#define AT91C_EMAC_SA3L ((AT91_REG *) 	0xFFFBC0A8) /* (EMAC) Specific Address 3 Low, First 4 bytes*/
#define AT91C_EMAC_DTE  ((AT91_REG *) 	0xFFFBC058) /* (EMAC) Deferred Transmission Frame Register*/
#define AT91C_EMAC_TUE  ((AT91_REG *) 	0xFFFBC068) /* (EMAC) Transmit Underrun Error Register*/
#define AT91C_EMAC_TCR  ((AT91_REG *) 	0xFFFBC010) /* (EMAC) Transmit Control Register*/
#define AT91C_EMAC_ECOL ((AT91_REG *) 	0xFFFBC060) /* (EMAC) Excessive Collision Register*/
#define AT91C_EMAC_MCOL ((AT91_REG *) 	0xFFFBC048) /* (EMAC) Multiple Collision Frame Register*/
#define AT91C_EMAC_IER  ((AT91_REG *) 	0xFFFBC028) /* (EMAC) Interrupt Enable Register*/
#define AT91C_EMAC_USF  ((AT91_REG *) 	0xFFFBC078) /* (EMAC) Undersize Frame Register*/
#define AT91C_EMAC_SEQE ((AT91_REG *) 	0xFFFBC050) /* (EMAC) Frame Check Sequence Error Register*/
#define AT91C_EMAC_SA1L ((AT91_REG *) 	0xFFFBC098) /* (EMAC) Specific Address 1 Low, First 4 bytes*/
#define AT91C_EMAC_CTL  ((AT91_REG *) 	0xFFFBC000) /* (EMAC) Network Control Register*/
#define AT91C_EMAC_CFG  ((AT91_REG *) 	0xFFFBC004) /* (EMAC) Network Configuration Register*/
#define AT91C_EMAC_HSL  ((AT91_REG *) 	0xFFFBC094) /* (EMAC) Hash Address Low[31:0]*/
#define AT91C_EMAC_SCOL ((AT91_REG *) 	0xFFFBC044) /* (EMAC) Single Collision Frame Register*/
#define AT91C_EMAC_LCOL ((AT91_REG *) 	0xFFFBC05C) /* (EMAC) Late Collision Register*/
#define AT91C_EMAC_SA3H ((AT91_REG *) 	0xFFFBC0AC) /* (EMAC) Specific Address 3 High, Last 2 bytes*/
#define AT91C_EMAC_HSH  ((AT91_REG *) 	0xFFFBC090) /* (EMAC) Hash Address High[63:32]*/
#define AT91C_EMAC_IMR  ((AT91_REG *) 	0xFFFBC030) /* (EMAC) Interrupt Mask Register*/
#define AT91C_EMAC_DRFC ((AT91_REG *) 	0xFFFBC080) /* (EMAC) Discarded RX Frame Register*/
#define AT91C_EMAC_TSR  ((AT91_REG *) 	0xFFFBC014) /* (EMAC) Transmit Status Register*/
#define AT91C_EMAC_OK   ((AT91_REG *) 	0xFFFBC04C) /* (EMAC) Frames Received OK Register*/
#define AT91C_EMAC_IDR  ((AT91_REG *) 	0xFFFBC02C) /* (EMAC) Interrupt Disable Register*/
#define AT91C_EMAC_SA1H ((AT91_REG *) 	0xFFFBC09C) /* (EMAC) Specific Address 1 High, Last 2 bytes*/
#define AT91C_EMAC_CSE  ((AT91_REG *) 	0xFFFBC064) /* (EMAC) Carrier Sense Error Register*/
#define AT91C_EMAC_TAR  ((AT91_REG *) 	0xFFFBC00C) /* (EMAC) Transmit Address Register*/
#define AT91C_EMAC_RSR  ((AT91_REG *) 	0xFFFBC020) /* (EMAC) Receive Status Register*/
#define AT91C_EMAC_SA2L ((AT91_REG *) 	0xFFFBC0A0) /* (EMAC) Specific Address 2 Low, First 4 bytes*/
#define AT91C_EMAC_FRA  ((AT91_REG *) 	0xFFFBC040) /* (EMAC) Frames Transmitted OK Register*/
#define AT91C_EMAC_RJB  ((AT91_REG *) 	0xFFFBC074) /* (EMAC) Receive Jabber Register*/
#define AT91C_EMAC_SR   ((AT91_REG *) 	0xFFFBC008) /* (EMAC) Network Status Register*/
#define AT91C_EMAC_RBQP ((AT91_REG *) 	0xFFFBC018) /* (EMAC) Receive Buffer Queue Pointer*/
/* ========== Register definition for EBI peripheral ========== */
#define AT91C_EBI_CFGR  ((AT91_REG *) 	0xFFFFFF64) /* (EBI) Configuration Register*/
#define AT91C_EBI_CSA   ((AT91_REG *) 	0xFFFFFF60) /* (EBI) Chip Select Assignment Register*/
/* ========== Register definition for SMC2 peripheral ========== */
#define AT91C_SMC2_CSR  ((AT91_REG *) 	0xFFFFFF70) /* (SMC2) SMC2 Chip Select Register*/
/* ========== Register definition for SDRC peripheral ========== */
#define AT91C_SDRC_LPR  ((AT91_REG *) 	0xFFFFFFA0) /* (SDRC) SDRAM Controller Low Power Register*/
#define AT91C_SDRC_ISR  ((AT91_REG *) 	0xFFFFFFB0) /* (SDRC) SDRAM Controller Interrupt Mask Register*/
#define AT91C_SDRC_IER  ((AT91_REG *) 	0xFFFFFFA4) /* (SDRC) SDRAM Controller Interrupt Enable Register*/
#define AT91C_SDRC_CR   ((AT91_REG *) 	0xFFFFFF98) /* (SDRC) SDRAM Controller Configuration Register*/
#define AT91C_SDRC_IDR  ((AT91_REG *) 	0xFFFFFFA8) /* (SDRC) SDRAM Controller Interrupt Disable Register*/
#define AT91C_SDRC_IMR  ((AT91_REG *) 	0xFFFFFFAC) /* (SDRC) SDRAM Controller Interrupt Mask Register*/
#define AT91C_SDRC_SRR  ((AT91_REG *) 	0xFFFFFF9C) /* (SDRC) SDRAM Controller Self Refresh Register*/
#define AT91C_SDRC_MR   ((AT91_REG *) 	0xFFFFFF90) /* (SDRC) SDRAM Controller Mode Register*/
#define AT91C_SDRC_TR   ((AT91_REG *) 	0xFFFFFF94) /* (SDRC) SDRAM Controller Refresh Timer Register*/
/* ========== Register definition for BFC peripheral ========== */
#define AT91C_BFC_MR    ((AT91_REG *) 	0xFFFFFFC0) /* (BFC) BFC Mode Register*/

