una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91rm9200.h
/* ******************************************************************************/
/*               PIO DEFINITIONS FOR AT91RM9200*/
/* ******************************************************************************/
#define AT91C_PIO_PA0        ((unsigned int) 1 <<  0) /* Pin Controlled by PA0*/
#define AT91C_PA0_MISO     ((unsigned int) AT91C_PIO_PA0) /*  SPI Master In Slave*/
#define AT91C_PA0_PCK3     ((unsigned int) AT91C_PIO_PA0) /*  PMC Programmable Clock Output 3*/
#define AT91C_PIO_PA1        ((unsigned int) 1 <<  1) /* Pin Controlled by PA1*/
#define AT91C_PA1_MOSI     ((unsigned int) AT91C_PIO_PA1) /*  SPI Master Out Slave*/
#define AT91C_PA1_PCK0     ((unsigned int) AT91C_PIO_PA1) /*  PMC Programmable Clock Output 0*/
#define AT91C_PIO_PA10       ((unsigned int) 1 << 10) /* Pin Controlled by PA10*/
#define AT91C_PA10_ETX1     ((unsigned int) AT91C_PIO_PA10) /*  Ethernet MAC Transmit Data 1*/
#define AT91C_PA10_MCDB1    ((unsigned int) AT91C_PIO_PA10) /*  Multimedia Card B Data 1*/
#define AT91C_PIO_PA11       ((unsigned int) 1 << 11) /* Pin Controlled by PA11*/
#define AT91C_PA11_ECRS_ECRSDV ((unsigned int) AT91C_PIO_PA11) /*  Ethernet MAC Carrier Sense/Carrier Sense and Data Valid*/
#define AT91C_PA11_MCDB2    ((unsigned int) AT91C_PIO_PA11) /*  Multimedia Card B Data 2*/
#define AT91C_PIO_PA12       ((unsigned int) 1 << 12) /* Pin Controlled by PA12*/
#define AT91C_PA12_ERX0     ((unsigned int) AT91C_PIO_PA12) /*  Ethernet MAC Receive Data 0*/
#define AT91C_PA12_MCDB3    ((unsigned int) AT91C_PIO_PA12) /*  Multimedia Card B Data 3*/
#define AT91C_PIO_PA13       ((unsigned int) 1 << 13) /* Pin Controlled by PA13*/
#define AT91C_PA13_ERX1     ((unsigned int) AT91C_PIO_PA13) /*  Ethernet MAC Receive Data 1*/
#define AT91C_PA13_TCLK0    ((unsigned int) AT91C_PIO_PA13) /*  Timer Counter 0 external clock input*/
#define AT91C_PIO_PA14       ((unsigned int) 1 << 14) /* Pin Controlled by PA14*/
#define AT91C_PA14_ERXER    ((unsigned int) AT91C_PIO_PA14) /*  Ethernet MAC Receive Error*/
#define AT91C_PA14_TCLK1    ((unsigned int) AT91C_PIO_PA14) /*  Timer Counter 1 external clock input*/
#define AT91C_PIO_PA15       ((unsigned int) 1 << 15) /* Pin Controlled by PA15*/
#define AT91C_PA15_EMDC     ((unsigned int) AT91C_PIO_PA15) /*  Ethernet MAC Management Data Clock*/
#define AT91C_PA15_TCLK2    ((unsigned int) AT91C_PIO_PA15) /*  Timer Counter 2 external clock input*/
#define AT91C_PIO_PA16       ((unsigned int) 1 << 16) /* Pin Controlled by PA16*/
#define AT91C_PA16_EMDIO    ((unsigned int) AT91C_PIO_PA16) /*  Ethernet MAC Management Data Input/Output*/
#define AT91C_PA16_IRQ6     ((unsigned int) AT91C_PIO_PA16) /*  AIC Interrupt input 6*/
#define AT91C_PIO_PA17       ((unsigned int) 1 << 17) /* Pin Controlled by PA17*/
#define AT91C_PA17_TXD0     ((unsigned int) AT91C_PIO_PA17) /*  USART 0 Transmit Data*/
#define AT91C_PA17_TIOA0    ((unsigned int) AT91C_PIO_PA17) /*  Timer Counter 0 Multipurpose Timer I/O Pin A*/
#define AT91C_PIO_PA18       ((unsigned int) 1 << 18) /* Pin Controlled by PA18*/
#define AT91C_PA18_RXD0     ((unsigned int) AT91C_PIO_PA18) /*  USART 0 Receive Data*/
#define AT91C_PA18_TIOB0    ((unsigned int) AT91C_PIO_PA18) /*  Timer Counter 0 Multipurpose Timer I/O Pin B*/
#define AT91C_PIO_PA19       ((unsigned int) 1 << 19) /* Pin Controlled by PA19*/
#define AT91C_PA19_SCK0     ((unsigned int) AT91C_PIO_PA19) /*  USART 0 Serial Clock*/
#define AT91C_PA19_TIOA1    ((unsigned int) AT91C_PIO_PA19) /*  Timer Counter 1 Multipurpose Timer I/O Pin A*/
#define AT91C_PIO_PA2        ((unsigned int) 1 <<  2) /* Pin Controlled by PA2*/
#define AT91C_PA2_SPCK     ((unsigned int) AT91C_PIO_PA2) /*  SPI Serial Clock*/
#define AT91C_PA2_IRQ4     ((unsigned int) AT91C_PIO_PA2) /*  AIC Interrupt Input 4*/
#define AT91C_PIO_PA20       ((unsigned int) 1 << 20) /* Pin Controlled by PA20*/
#define AT91C_PA20_CTS0     ((unsigned int) AT91C_PIO_PA20) /*  USART 0 Clear To Send*/
#define AT91C_PA20_TIOB1    ((unsigned int) AT91C_PIO_PA20) /*  Timer Counter 1 Multipurpose Timer I/O Pin B*/
#define AT91C_PIO_PA21       ((unsigned int) 1 << 21) /* Pin Controlled by PA21*/
#define AT91C_PA21_RTS0     ((unsigned int) AT91C_PIO_PA21) /*  Usart 0 Ready To Send*/
#define AT91C_PA21_TIOA2    ((unsigned int) AT91C_PIO_PA21) /*  Timer Counter 2 Multipurpose Timer I/O Pin A*/
#define AT91C_PIO_PA22       ((unsigned int) 1 << 22) /* Pin Controlled by PA22*/
#define AT91C_PA22_RXD2     ((unsigned int) AT91C_PIO_PA22) /*  USART 2 Receive Data*/
#define AT91C_PA22_TIOB2    ((unsigned int) AT91C_PIO_PA22) /*  Timer Counter 2 Multipurpose Timer I/O Pin B*/
#define AT91C_PIO_PA23       ((unsigned int) 1 << 23) /* Pin Controlled by PA23*/
#define AT91C_PA23_TXD2     ((unsigned int) AT91C_PIO_PA23) /*  USART 2 Transmit Data*/
#define AT91C_PA23_IRQ3     ((unsigned int) AT91C_PIO_PA23) /*  Interrupt input 3*/
#define AT91C_PIO_PA24       ((unsigned int) 1 << 24) /* Pin Controlled by PA24*/
#define AT91C_PA24_SCK2     ((unsigned int) AT91C_PIO_PA24) /*  USART2 Serial Clock*/
#define AT91C_PA24_PCK1     ((unsigned int) AT91C_PIO_PA24) /*  PMC Programmable Clock Output 1*/
#define AT91C_PIO_PA25       ((unsigned int) 1 << 25) /* Pin Controlled by PA25*/
#define AT91C_PA25_TWD      ((unsigned int) AT91C_PIO_PA25) /*  TWI Two-wire Serial Data*/
#define AT91C_PA25_IRQ2     ((unsigned int) AT91C_PIO_PA25) /*  Interrupt input 2*/
#define AT91C_PIO_PA26       ((unsigned int) 1 << 26) /* Pin Controlled by PA26*/
#define AT91C_PA26_TWCK     ((unsigned int) AT91C_PIO_PA26) /*  TWI Two-wire Serial Clock*/
#define AT91C_PA26_IRQ1     ((unsigned int) AT91C_PIO_PA26) /*  Interrupt input 1*/
#define AT91C_PIO_PA27       ((unsigned int) 1 << 27) /* Pin Controlled by PA27*/
#define AT91C_PA27_MCCK     ((unsigned int) AT91C_PIO_PA27) /*  Multimedia Card Clock*/
#define AT91C_PA27_TCLK3    ((unsigned int) AT91C_PIO_PA27) /*  Timer Counter 3 External Clock Input*/
#define AT91C_PIO_PA28       ((unsigned int) 1 << 28) /* Pin Controlled by PA28*/
#define AT91C_PA28_MCCDA    ((unsigned int) AT91C_PIO_PA28) /*  Multimedia Card A Command*/
#define AT91C_PA28_TCLK4    ((unsigned int) AT91C_PIO_PA28) /*  Timer Counter 4 external Clock Input*/
#define AT91C_PIO_PA29       ((unsigned int) 1 << 29) /* Pin Controlled by PA29*/
#define AT91C_PA29_MCDA0    ((unsigned int) AT91C_PIO_PA29) /*  Multimedia Card A Data 0*/
#define AT91C_PA29_TCLK5    ((unsigned int) AT91C_PIO_PA29) /*  Timer Counter 5 external clock input*/
#define AT91C_PIO_PA3        ((unsigned int) 1 <<  3) /* Pin Controlled by PA3*/
#define AT91C_PA3_NPCS0    ((unsigned int) AT91C_PIO_PA3) /*  SPI Peripheral Chip Select 0*/
#define AT91C_PA3_IRQ5     ((unsigned int) AT91C_PIO_PA3) /*  AIC Interrupt Input 5*/
#define AT91C_PIO_PA30       ((unsigned int) 1 << 30) /* Pin Controlled by PA30*/
#define AT91C_PA30_DRXD     ((unsigned int) AT91C_PIO_PA30) /*  DBGU Debug Receive Data*/
#define AT91C_PA30_CTS2     ((unsigned int) AT91C_PIO_PA30) /*  Usart 2 Clear To Send*/
#define AT91C_PIO_PA31       ((unsigned int) 1 << 31) /* Pin Controlled by PA31*/
#define AT91C_PA31_DTXD     ((unsigned int) AT91C_PIO_PA31) /*  DBGU Debug Transmit Data*/
#define AT91C_PA31_RTS2     ((unsigned int) AT91C_PIO_PA31) /*  USART 2 Ready To Send*/
#define AT91C_PIO_PA4        ((unsigned int) 1 <<  4) /* Pin Controlled by PA4*/
#define AT91C_PA4_NPCS1    ((unsigned int) AT91C_PIO_PA4) /*  SPI Peripheral Chip Select 1*/
#define AT91C_PA4_PCK1     ((unsigned int) AT91C_PIO_PA4) /*  PMC Programmable Clock Output 1*/
#define AT91C_PIO_PA5        ((unsigned int) 1 <<  5) /* Pin Controlled by PA5*/
#define AT91C_PA5_NPCS2    ((unsigned int) AT91C_PIO_PA5) /*  SPI Peripheral Chip Select 2*/
#define AT91C_PA5_TXD3     ((unsigned int) AT91C_PIO_PA5) /*  USART 3 Transmit Data*/
#define AT91C_PIO_PA6        ((unsigned int) 1 <<  6) /* Pin Controlled by PA6*/
#define AT91C_PA6_NPCS3    ((unsigned int) AT91C_PIO_PA6) /*  SPI Peripheral Chip Select 3*/
#define AT91C_PA6_RXD3     ((unsigned int) AT91C_PIO_PA6) /*  USART 3 Receive Data*/
#define AT91C_PIO_PA7        ((unsigned int) 1 <<  7) /* Pin Controlled by PA7*/
#define AT91C_PA7_ETXCK_EREFCK ((unsigned int) AT91C_PIO_PA7) /*  Ethernet MAC Transmit Clock/Reference Clock*/
#define AT91C_PA7_PCK2     ((unsigned int) AT91C_PIO_PA7) /*  PMC Programmable Clock 2*/
#define AT91C_PIO_PA8        ((unsigned int) 1 <<  8) /* Pin Controlled by PA8*/
#define AT91C_PA8_ETXEN    ((unsigned int) AT91C_PIO_PA8) /*  Ethernet MAC Transmit Enable*/
#define AT91C_PA8_MCCDB    ((unsigned int) AT91C_PIO_PA8) /*  Multimedia Card B Command*/
#define AT91C_PIO_PA9        ((unsigned int) 1 <<  9) /* Pin Controlled by PA9*/
#define AT91C_PA9_ETX0     ((unsigned int) AT91C_PIO_PA9) /*  Ethernet MAC Transmit Data 0*/
#define AT91C_PA9_MCDB0    ((unsigned int) AT91C_PIO_PA9) /*  Multimedia Card B Data 0*/
#define AT91C_PIO_PB0        ((unsigned int) 1 <<  0) /* Pin Controlled by PB0*/
#define AT91C_PB0_TF0      ((unsigned int) AT91C_PIO_PB0) /*  SSC Transmit Frame Sync 0*/
#define AT91C_PB0_TIOB3    ((unsigned int) AT91C_PIO_PB0) /*  Timer Counter 3 Multipurpose Timer I/O Pin B*/
#define AT91C_PIO_PB1        ((unsigned int) 1 <<  1) /* Pin Controlled by PB1*/
#define AT91C_PB1_TK0      ((unsigned int) AT91C_PIO_PB1) /*  SSC Transmit Clock 0*/
#define AT91C_PB1_CTS3     ((unsigned int) AT91C_PIO_PB1) /*  USART 3 Clear To Send*/
#define AT91C_PIO_PB10       ((unsigned int) 1 << 10) /* Pin Controlled by PB10*/
#define AT91C_PB10_RK1      ((unsigned int) AT91C_PIO_PB10) /*  SSC Receive Clock 1*/
#define AT91C_PB10_TIOA5    ((unsigned int) AT91C_PIO_PB10) /*  Timer Counter 5 Multipurpose Timer I/O Pin A*/
#define AT91C_PIO_PB11       ((unsigned int) 1 << 11) /* Pin Controlled by PB11*/
#define AT91C_PB11_RF1      ((unsigned int) AT91C_PIO_PB11) /*  SSC Receive Frame Sync 1*/
#define AT91C_PB11_TIOB5    ((unsigned int) AT91C_PIO_PB11) /*  Timer Counter 5 Multipurpose Timer I/O Pin B*/
#define AT91C_PIO_PB12       ((unsigned int) 1 << 12) /* Pin Controlled by PB12*/
#define AT91C_PB12_TF2      ((unsigned int) AT91C_PIO_PB12) /*  SSC Transmit Frame Sync 2*/
#define AT91C_PB12_ETX2     ((unsigned int) AT91C_PIO_PB12) /*  Ethernet MAC Transmit Data 2*/
#define AT91C_PIO_PB13       ((unsigned int) 1 << 13) /* Pin Controlled by PB13*/
#define AT91C_PB13_TK2      ((unsigned int) AT91C_PIO_PB13) /*  SSC Transmit Clock 2*/
#define AT91C_PB13_ETX3     ((unsigned int) AT91C_PIO_PB13) /*  Ethernet MAC Transmit Data 3*/
#define AT91C_PIO_PB14       ((unsigned int) 1 << 14) /* Pin Controlled by PB14*/
#define AT91C_PB14_TD2      ((unsigned int) AT91C_PIO_PB14) /*  SSC Transmit Data 2*/
#define AT91C_PB14_ETXER    ((unsigned int) AT91C_PIO_PB14) /*  Ethernet MAC Transmikt Coding Error*/
#define AT91C_PIO_PB15       ((unsigned int) 1 << 15) /* Pin Controlled by PB15*/
#define AT91C_PB15_RD2      ((unsigned int) AT91C_PIO_PB15) /*  SSC Receive Data 2*/
#define AT91C_PB15_ERX2     ((unsigned int) AT91C_PIO_PB15) /*  Ethernet MAC Receive Data 2*/
#define AT91C_PIO_PB16       ((unsigned int) 1 << 16) /* Pin Controlled by PB16*/
#define AT91C_PB16_RK2      ((unsigned int) AT91C_PIO_PB16) /*  SSC Receive Clock 2*/
#define AT91C_PB16_ERX3     ((unsigned int) AT91C_PIO_PB16) /*  Ethernet MAC Receive Data 3*/
#define AT91C_PIO_PB17       ((unsigned int) 1 << 17) /* Pin Controlled by PB17*/
#define AT91C_PB17_RF2      ((unsigned int) AT91C_PIO_PB17) /*  SSC Receive Frame Sync 2*/
#define AT91C_PB17_ERXDV    ((unsigned int) AT91C_PIO_PB17) /*  Ethernet MAC Receive Data Valid*/
#define AT91C_PIO_PB18       ((unsigned int) 1 << 18) /* Pin Controlled by PB18*/
#define AT91C_PB18_RI1      ((unsigned int) AT91C_PIO_PB18) /*  USART 1 Ring Indicator*/
#define AT91C_PB18_ECOL     ((unsigned int) AT91C_PIO_PB18) /*  Ethernet MAC Collision Detected*/
#define AT91C_PIO_PB19       ((unsigned int) 1 << 19) /* Pin Controlled by PB19*/
#define AT91C_PB19_DTR1     ((unsigned int) AT91C_PIO_PB19) /*  USART 1 Data Terminal ready*/
#define AT91C_PB19_ERXCK    ((unsigned int) AT91C_PIO_PB19) /*  Ethernet MAC Receive Clock*/
#define AT91C_PIO_PB2        ((unsigned int) 1 <<  2) /* Pin Controlled by PB2*/
#define AT91C_PB2_TD0      ((unsigned int) AT91C_PIO_PB2) /*  SSC Transmit data*/
#define AT91C_PB2_SCK3     ((unsigned int) AT91C_PIO_PB2) /*  USART 3 Serial Clock*/
#define AT91C_PIO_PB20       ((unsigned int) 1 << 20) /* Pin Controlled by PB20*/
#define AT91C_PB20_TXD1     ((unsigned int) AT91C_PIO_PB20) /*  USART 1 Transmit Data*/
#define AT91C_PIO_PB21       ((unsigned int) 1 << 21) /* Pin Controlled by PB21*/
#define AT91C_PB21_RXD1     ((unsigned int) AT91C_PIO_PB21) /*  USART 1 Receive Data*/
#define AT91C_PIO_PB22       ((unsigned int) 1 << 22) /* Pin Controlled by PB22*/
#define AT91C_PB22_SCK1     ((unsigned int) AT91C_PIO_PB22) /*  USART1 Serial Clock*/
#define AT91C_PIO_PB23       ((unsigned int) 1 << 23) /* Pin Controlled by PB23*/
#define AT91C_PB23_DCD1     ((unsigned int) AT91C_PIO_PB23) /*  USART 1 Data Carrier Detect*/
#define AT91C_PIO_PB24       ((unsigned int) 1 << 24) /* Pin Controlled by PB24*/
#define AT91C_PB24_CTS1     ((unsigned int) AT91C_PIO_PB24) /*  USART 1 Clear To Send*/
#define AT91C_PIO_PB25       ((unsigned int) 1 << 25) /* Pin Controlled by PB25*/
#define AT91C_PB25_DSR1     ((unsigned int) AT91C_PIO_PB25) /*  USART 1 Data Set ready*/
#define AT91C_PB25_EF100    ((unsigned int) AT91C_PIO_PB25) /*  Ethernet MAC Force 100 Mbits/sec*/
#define AT91C_PIO_PB26       ((unsigned int) 1 << 26) /* Pin Controlled by PB26*/
#define AT91C_PB26_RTS1     ((unsigned int) AT91C_PIO_PB26) /*  Usart 0 Ready To Send*/
#define AT91C_PIO_PB27       ((unsigned int) 1 << 27) /* Pin Controlled by PB27*/
#define AT91C_PB27_PCK0     ((unsigned int) AT91C_PIO_PB27) /*  PMC Programmable Clock Output 0*/
#define AT91C_PIO_PB28       ((unsigned int) 1 << 28) /* Pin Controlled by PB28*/
#define AT91C_PB28_FIQ      ((unsigned int) AT91C_PIO_PB28) /*  AIC Fast Interrupt Input*/
#define AT91C_PIO_PB29       ((unsigned int) 1 << 29) /* Pin Controlled by PB29*/
#define AT91C_PB29_IRQ0     ((unsigned int) AT91C_PIO_PB29) /*  Interrupt input 0*/
#define AT91C_PIO_PB3        ((unsigned int) 1 <<  3) /* Pin Controlled by PB3*/
#define AT91C_PB3_RD0      ((unsigned int) AT91C_PIO_PB3) /*  SSC Receive Data*/
#define AT91C_PB3_MCDA1    ((unsigned int) AT91C_PIO_PB3) /*  Multimedia Card A Data 1*/
#define AT91C_PIO_PB4        ((unsigned int) 1 <<  4) /* Pin Controlled by PB4*/
#define AT91C_PB4_RK0      ((unsigned int) AT91C_PIO_PB4) /*  SSC Receive Clock*/
#define AT91C_PB4_MCDA2    ((unsigned int) AT91C_PIO_PB4) /*  Multimedia Card A Data 2*/
#define AT91C_PIO_PB5        ((unsigned int) 1 <<  5) /* Pin Controlled by PB5*/
#define AT91C_PB5_RF0      ((unsigned int) AT91C_PIO_PB5) /*  SSC Receive Frame Sync 0*/
#define AT91C_PB5_MCDA3    ((unsigned int) AT91C_PIO_PB5) /*  Multimedia Card A Data 3*/
#define AT91C_PIO_PB6        ((unsigned int) 1 <<  6) /* Pin Controlled by PB6*/
#define AT91C_PB6_TF1      ((unsigned int) AT91C_PIO_PB6) /*  SSC Transmit Frame Sync 1*/
#define AT91C_PB6_TIOA3    ((unsigned int) AT91C_PIO_PB6) /*  Timer Counter 4 Multipurpose Timer I/O Pin A*/
#define AT91C_PIO_PB7        ((unsigned int) 1 <<  7) /* Pin Controlled by PB7*/
#define AT91C_PB7_TK1      ((unsigned int) AT91C_PIO_PB7) /*  SSC Transmit Clock 1*/
#define AT91C_PB7_TIOB3    ((unsigned int) AT91C_PIO_PB7) /*  Timer Counter 3 Multipurpose Timer I/O Pin B*/
#define AT91C_PIO_PB8        ((unsigned int) 1 <<  8) /* Pin Controlled by PB8*/
#define AT91C_PB8_TD1      ((unsigned int) AT91C_PIO_PB8) /*  SSC Transmit Data 1*/
#define AT91C_PB8_TIOA4    ((unsigned int) AT91C_PIO_PB8) /*  Timer Counter 4 Multipurpose Timer I/O Pin A*/
#define AT91C_PIO_PB9        ((unsigned int) 1 <<  9) /* Pin Controlled by PB9*/
#define AT91C_PB9_RD1      ((unsigned int) AT91C_PIO_PB9) /*  SSC Receive Data 1*/
#define AT91C_PB9_TIOB4    ((unsigned int) AT91C_PIO_PB9) /*  Timer Counter 4 Multipurpose Timer I/O Pin B*/
#define AT91C_PIO_PC0        ((unsigned int) 1 <<  0) /* Pin Controlled by PC0*/
#define AT91C_PC0_BFCK     ((unsigned int) AT91C_PIO_PC0) /*  Burst Flash Clock*/
#define AT91C_PIO_PC1        ((unsigned int) 1 <<  1) /* Pin Controlled by PC1*/
#define AT91C_PC1_BFRDY_SMOE ((unsigned int) AT91C_PIO_PC1) /*  Burst Flash Ready*/
#define AT91C_PIO_PC10       ((unsigned int) 1 << 10) /* Pin Controlled by PC10*/
#define AT91C_PC10_NCS4_CFCS ((unsigned int) AT91C_PIO_PC10) /*  Compact Flash Chip Select*/
#define AT91C_PIO_PC11       ((unsigned int) 1 << 11) /* Pin Controlled by PC11*/
#define AT91C_PC11_NCS5_CFCE1 ((unsigned int) AT91C_PIO_PC11) /*  Chip Select 5 / Compact Flash Chip Enable 1*/
#define AT91C_PIO_PC12       ((unsigned int) 1 << 12) /* Pin Controlled by PC12*/
#define AT91C_PC12_NCS6_CFCE2 ((unsigned int) AT91C_PIO_PC12) /*  Chip Select 6 / Compact Flash Chip Enable 2*/
#define AT91C_PIO_PC13       ((unsigned int) 1 << 13) /* Pin Controlled by PC13*/
#define AT91C_PC13_NCS7     ((unsigned int) AT91C_PIO_PC13) /*  Chip Select 7*/
#define AT91C_PIO_PC14       ((unsigned int) 1 << 14) /* Pin Controlled by PC14*/
#define AT91C_PIO_PC15       ((unsigned int) 1 << 15) /* Pin Controlled by PC15*/
#define AT91C_PIO_PC16       ((unsigned int) 1 << 16) /* Pin Controlled by PC16*/
#define AT91C_PC16_D16      ((unsigned int) AT91C_PIO_PC16) /*  Data Bus [16]*/
#define AT91C_PIO_PC17       ((unsigned int) 1 << 17) /* Pin Controlled by PC17*/
#define AT91C_PC17_D17      ((unsigned int) AT91C_PIO_PC17) /*  Data Bus [17]*/
#define AT91C_PIO_PC18       ((unsigned int) 1 << 18) /* Pin Controlled by PC18*/
#define AT91C_PC18_D18      ((unsigned int) AT91C_PIO_PC18) /*  Data Bus [18]*/
#define AT91C_PIO_PC19       ((unsigned int) 1 << 19) /* Pin Controlled by PC19*/
#define AT91C_PC19_D19      ((unsigned int) AT91C_PIO_PC19) /*  Data Bus [19]*/
#define AT91C_PIO_PC2        ((unsigned int) 1 <<  2) /* Pin Controlled by PC2*/
#define AT91C_PC2_BFAVD    ((unsigned int) AT91C_PIO_PC2) /*  Burst Flash Address Valid*/
#define AT91C_PIO_PC20       ((unsigned int) 1 << 20) /* Pin Controlled by PC20*/
#define AT91C_PC20_D20      ((unsigned int) AT91C_PIO_PC20) /*  Data Bus [20]*/
#define AT91C_PIO_PC21       ((unsigned int) 1 << 21) /* Pin Controlled by PC21*/
#define AT91C_PC21_D21      ((unsigned int) AT91C_PIO_PC21) /*  Data Bus [21]*/
#define AT91C_PIO_PC22       ((unsigned int) 1 << 22) /* Pin Controlled by PC22*/
#define AT91C_PC22_D22      ((unsigned int) AT91C_PIO_PC22) /*  Data Bus [22]*/
#define AT91C_PIO_PC23       ((unsigned int) 1 << 23) /* Pin Controlled by PC23*/
#define AT91C_PC23_D23      ((unsigned int) AT91C_PIO_PC23) /*  Data Bus [23]*/
#define AT91C_PIO_PC24       ((unsigned int) 1 << 24) /* Pin Controlled by PC24*/
#define AT91C_PC24_D24      ((unsigned int) AT91C_PIO_PC24) /*  Data Bus [24]*/
#define AT91C_PIO_PC25       ((unsigned int) 1 << 25) /* Pin Controlled by PC25*/
#define AT91C_PC25_D25      ((unsigned int) AT91C_PIO_PC25) /*  Data Bus [25]*/
#define AT91C_PIO_PC26       ((unsigned int) 1 << 26) /* Pin Controlled by PC26*/
#define AT91C_PC26_D26      ((unsigned int) AT91C_PIO_PC26) /*  Data Bus [26]*/
#define AT91C_PIO_PC27       ((unsigned int) 1 << 27) /* Pin Controlled by PC27*/
#define AT91C_PC27_D27      ((unsigned int) AT91C_PIO_PC27) /*  Data Bus [27]*/
#define AT91C_PIO_PC28       ((unsigned int) 1 << 28) /* Pin Controlled by PC28*/
#define AT91C_PC28_D28      ((unsigned int) AT91C_PIO_PC28) /*  Data Bus [28]*/
#define AT91C_PIO_PC29       ((unsigned int) 1 << 29) /* Pin Controlled by PC29*/
#define AT91C_PC29_D29      ((unsigned int) AT91C_PIO_PC29) /*  Data Bus [29]*/
#define AT91C_PIO_PC3        ((unsigned int) 1 <<  3) /* Pin Controlled by PC3*/
#define AT91C_PC3_BFBAA_SMWE ((unsigned int) AT91C_PIO_PC3) /*  Burst Flash Address Advance / SmartMedia Write Enable*/
#define AT91C_PIO_PC30       ((unsigned int) 1 << 30) /* Pin Controlled by PC30*/
#define AT91C_PC30_D30      ((unsigned int) AT91C_PIO_PC30) /*  Data Bus [30]*/
#define AT91C_PIO_PC31       ((unsigned int) 1 << 31) /* Pin Controlled by PC31*/
#define AT91C_PC31_D31      ((unsigned int) AT91C_PIO_PC31) /*  Data Bus [31]*/
#define AT91C_PIO_PC4        ((unsigned int) 1 <<  4) /* Pin Controlled by PC4*/
#define AT91C_PC4_BFOE     ((unsigned int) AT91C_PIO_PC4) /*  Burst Flash Output Enable*/
#define AT91C_PIO_PC5        ((unsigned int) 1 <<  5) /* Pin Controlled by PC5*/
#define AT91C_PC5_BFWE     ((unsigned int) AT91C_PIO_PC5) /*  Burst Flash Write Enable*/
#define AT91C_PIO_PC6        ((unsigned int) 1 <<  6) /* Pin Controlled by PC6*/
#define AT91C_PC6_NWAIT    ((unsigned int) AT91C_PIO_PC6) /*  NWAIT*/
#define AT91C_PIO_PC7        ((unsigned int) 1 <<  7) /* Pin Controlled by PC7*/
#define AT91C_PC7_A23      ((unsigned int) AT91C_PIO_PC7) /*  Address Bus[23]*/
#define AT91C_PIO_PC8        ((unsigned int) 1 <<  8) /* Pin Controlled by PC8*/
#define AT91C_PC8_A24      ((unsigned int) AT91C_PIO_PC8) /*  Address Bus[24]*/
#define AT91C_PIO_PC9        ((unsigned int) 1 <<  9) /* Pin Controlled by PC9*/
#define AT91C_PC9_A25_CFRNW ((unsigned int) AT91C_PIO_PC9) /*  Address Bus[25] /  Compact Flash Read Not Write*/
#define AT91C_PIO_PD0        ((unsigned int) 1 <<  0) /* Pin Controlled by PD0*/
#define AT91C_PD0_ETX0     ((unsigned int) AT91C_PIO_PD0) /*  Ethernet MAC Transmit Data 0*/
#define AT91C_PIO_PD1        ((unsigned int) 1 <<  1) /* Pin Controlled by PD1*/
#define AT91C_PD1_ETX1     ((unsigned int) AT91C_PIO_PD1) /*  Ethernet MAC Transmit Data 1*/
#define AT91C_PIO_PD10       ((unsigned int) 1 << 10) /* Pin Controlled by PD10*/
#define AT91C_PD10_PCK3     ((unsigned int) AT91C_PIO_PD10) /*  PMC Programmable Clock Output 3*/
#define AT91C_PD10_TPS1     ((unsigned int) AT91C_PIO_PD10) /*  ETM ARM9 pipeline status 1*/
#define AT91C_PIO_PD11       ((unsigned int) 1 << 11) /* Pin Controlled by PD11*/
#define AT91C_PD11_         ((unsigned int) AT91C_PIO_PD11) /*  */
#define AT91C_PD11_TPS2     ((unsigned int) AT91C_PIO_PD11) /*  ETM ARM9 pipeline status 2*/
#define AT91C_PIO_PD12       ((unsigned int) 1 << 12) /* Pin Controlled by PD12*/
#define AT91C_PD12_         ((unsigned int) AT91C_PIO_PD12) /*  */
#define AT91C_PD12_TPK0     ((unsigned int) AT91C_PIO_PD12) /*  ETM Trace Packet 0*/
#define AT91C_PIO_PD13       ((unsigned int) 1 << 13) /* Pin Controlled by PD13*/
#define AT91C_PD13_         ((unsigned int) AT91C_PIO_PD13) /*  */
#define AT91C_PD13_TPK1     ((unsigned int) AT91C_PIO_PD13) /*  ETM Trace Packet 1*/
#define AT91C_PIO_PD14       ((unsigned int) 1 << 14) /* Pin Controlled by PD14*/
#define AT91C_PD14_         ((unsigned int) AT91C_PIO_PD14) /*  */
#define AT91C_PD14_TPK2     ((unsigned int) AT91C_PIO_PD14) /*  ETM Trace Packet 2*/
#define AT91C_PIO_PD15       ((unsigned int) 1 << 15) /* Pin Controlled by PD15*/
#define AT91C_PD15_TD0      ((unsigned int) AT91C_PIO_PD15) /*  SSC Transmit data*/
#define AT91C_PD15_TPK3     ((unsigned int) AT91C_PIO_PD15) /*  ETM Trace Packet 3*/
#define AT91C_PIO_PD16       ((unsigned int) 1 << 16) /* Pin Controlled by PD16*/
#define AT91C_PD16_TD1      ((unsigned int) AT91C_PIO_PD16) /*  SSC Transmit Data 1*/
#define AT91C_PD16_TPK4     ((unsigned int) AT91C_PIO_PD16) /*  ETM Trace Packet 4*/
#define AT91C_PIO_PD17       ((unsigned int) 1 << 17) /* Pin Controlled by PD17*/
#define AT91C_PD17_TD2      ((unsigned int) AT91C_PIO_PD17) /*  SSC Transmit Data 2*/
#define AT91C_PD17_TPK5     ((unsigned int) AT91C_PIO_PD17) /*  ETM Trace Packet 5*/
#define AT91C_PIO_PD18       ((unsigned int) 1 << 18) /* Pin Controlled by PD18*/
#define AT91C_PD18_NPCS1    ((unsigned int) AT91C_PIO_PD18) /*  SPI Peripheral Chip Select 1*/
