una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91rm9200.h
#define AT91C_PD18_TPK6     ((unsigned int) AT91C_PIO_PD18) /*  ETM Trace Packet 6*/
#define AT91C_PIO_PD19       ((unsigned int) 1 << 19) /* Pin Controlled by PD19*/
#define AT91C_PD19_NPCS2    ((unsigned int) AT91C_PIO_PD19) /*  SPI Peripheral Chip Select 2*/
#define AT91C_PD19_TPK7     ((unsigned int) AT91C_PIO_PD19) /*  ETM Trace Packet 7*/
#define AT91C_PIO_PD2        ((unsigned int) 1 <<  2) /* Pin Controlled by PD2*/
#define AT91C_PD2_ETX2     ((unsigned int) AT91C_PIO_PD2) /*  Ethernet MAC Transmit Data 2*/
#define AT91C_PIO_PD20       ((unsigned int) 1 << 20) /* Pin Controlled by PD20*/
#define AT91C_PD20_NPCS3    ((unsigned int) AT91C_PIO_PD20) /*  SPI Peripheral Chip Select 3*/
#define AT91C_PD20_TPK8     ((unsigned int) AT91C_PIO_PD20) /*  ETM Trace Packet 8*/
#define AT91C_PIO_PD21       ((unsigned int) 1 << 21) /* Pin Controlled by PD21*/
#define AT91C_PD21_RTS0     ((unsigned int) AT91C_PIO_PD21) /*  Usart 0 Ready To Send*/
#define AT91C_PD21_TPK9     ((unsigned int) AT91C_PIO_PD21) /*  ETM Trace Packet 9*/
#define AT91C_PIO_PD22       ((unsigned int) 1 << 22) /* Pin Controlled by PD22*/
#define AT91C_PD22_RTS1     ((unsigned int) AT91C_PIO_PD22) /*  Usart 0 Ready To Send*/
#define AT91C_PD22_TPK10    ((unsigned int) AT91C_PIO_PD22) /*  ETM Trace Packet 10*/
#define AT91C_PIO_PD23       ((unsigned int) 1 << 23) /* Pin Controlled by PD23*/
#define AT91C_PD23_RTS2     ((unsigned int) AT91C_PIO_PD23) /*  USART 2 Ready To Send*/
#define AT91C_PD23_TPK11    ((unsigned int) AT91C_PIO_PD23) /*  ETM Trace Packet 11*/
#define AT91C_PIO_PD24       ((unsigned int) 1 << 24) /* Pin Controlled by PD24*/
#define AT91C_PD24_RTS3     ((unsigned int) AT91C_PIO_PD24) /*  USART 3 Ready To Send*/
#define AT91C_PD24_TPK12    ((unsigned int) AT91C_PIO_PD24) /*  ETM Trace Packet 12*/
#define AT91C_PIO_PD25       ((unsigned int) 1 << 25) /* Pin Controlled by PD25*/
#define AT91C_PD25_DTR1     ((unsigned int) AT91C_PIO_PD25) /*  USART 1 Data Terminal ready*/
#define AT91C_PD25_TPK13    ((unsigned int) AT91C_PIO_PD25) /*  ETM Trace Packet 13*/
#define AT91C_PIO_PD26       ((unsigned int) 1 << 26) /* Pin Controlled by PD26*/
#define AT91C_PD26_TPK14    ((unsigned int) AT91C_PIO_PD26) /*  ETM Trace Packet 14*/
#define AT91C_PIO_PD27       ((unsigned int) 1 << 27) /* Pin Controlled by PD27*/
#define AT91C_PD27_TPK15    ((unsigned int) AT91C_PIO_PD27) /*  ETM Trace Packet 15*/
#define AT91C_PIO_PD3        ((unsigned int) 1 <<  3) /* Pin Controlled by PD3*/
#define AT91C_PD3_ETX3     ((unsigned int) AT91C_PIO_PD3) /*  Ethernet MAC Transmit Data 3*/
#define AT91C_PIO_PD4        ((unsigned int) 1 <<  4) /* Pin Controlled by PD4*/
#define AT91C_PD4_ETXEN    ((unsigned int) AT91C_PIO_PD4) /*  Ethernet MAC Transmit Enable*/
#define AT91C_PIO_PD5        ((unsigned int) 1 <<  5) /* Pin Controlled by PD5*/
#define AT91C_PD5_ETXER    ((unsigned int) AT91C_PIO_PD5) /*  Ethernet MAC Transmikt Coding Error*/
#define AT91C_PIO_PD6        ((unsigned int) 1 <<  6) /* Pin Controlled by PD6*/
#define AT91C_PD6_DTXD     ((unsigned int) AT91C_PIO_PD6) /*  DBGU Debug Transmit Data*/
#define AT91C_PIO_PD7        ((unsigned int) 1 <<  7) /* Pin Controlled by PD7*/
#define AT91C_PD7_PCK0     ((unsigned int) AT91C_PIO_PD7) /*  PMC Programmable Clock Output 0*/
#define AT91C_PD7_TSYNC    ((unsigned int) AT91C_PIO_PD7) /*  ETM Synchronization signal*/
#define AT91C_PIO_PD8        ((unsigned int) 1 <<  8) /* Pin Controlled by PD8*/
#define AT91C_PD8_PCK1     ((unsigned int) AT91C_PIO_PD8) /*  PMC Programmable Clock Output 1*/
#define AT91C_PD8_TCLK     ((unsigned int) AT91C_PIO_PD8) /*  ETM Trace Clock signal*/
#define AT91C_PIO_PD9        ((unsigned int) 1 <<  9) /* Pin Controlled by PD9*/
#define AT91C_PD9_PCK2     ((unsigned int) AT91C_PIO_PD9) /*  PMC Programmable Clock 2*/
#define AT91C_PD9_TPS0     ((unsigned int) AT91C_PIO_PD9) /*  ETM ARM9 pipeline status 0*/

/* ******************************************************************************/
/*               PERIPHERAL ID DEFINITIONS FOR AT91RM9200*/
/* ******************************************************************************/
#define AT91C_ID_FIQ    ((unsigned int)  0) /* Advanced Interrupt Controller (FIQ)*/
#define AT91C_ID_SYS    ((unsigned int)  1) /* System Peripheral*/
#define AT91C_ID_PIOA   ((unsigned int)  2) /* Parallel IO Controller A */
#define AT91C_ID_PIOB   ((unsigned int)  3) /* Parallel IO Controller B*/
#define AT91C_ID_PIOC   ((unsigned int)  4) /* Parallel IO Controller C*/
#define AT91C_ID_PIOD   ((unsigned int)  5) /* Parallel IO Controller D*/
#define AT91C_ID_US0    ((unsigned int)  6) /* USART 0*/
#define AT91C_ID_US1    ((unsigned int)  7) /* USART 1*/
#define AT91C_ID_US2    ((unsigned int)  8) /* USART 2*/
#define AT91C_ID_US3    ((unsigned int)  9) /* USART 3*/
#define AT91C_ID_MCI    ((unsigned int) 10) /* Multimedia Card Interface*/
#define AT91C_ID_UDP    ((unsigned int) 11) /* USB Device Port*/
#define AT91C_ID_TWI    ((unsigned int) 12) /* Two-Wire Interface*/
#define AT91C_ID_SPI    ((unsigned int) 13) /* Serial Peripheral Interface*/
#define AT91C_ID_SSC0   ((unsigned int) 14) /* Serial Synchronous Controller 0*/
#define AT91C_ID_SSC1   ((unsigned int) 15) /* Serial Synchronous Controller 1*/
#define AT91C_ID_SSC2   ((unsigned int) 16) /* Serial Synchronous Controller 2*/
#define AT91C_ID_TC0    ((unsigned int) 17) /* Timer Counter 0*/
#define AT91C_ID_TC1    ((unsigned int) 18) /* Timer Counter 1*/
#define AT91C_ID_TC2    ((unsigned int) 19) /* Timer Counter 2*/
#define AT91C_ID_TC3    ((unsigned int) 20) /* Timer Counter 3*/
#define AT91C_ID_TC4    ((unsigned int) 21) /* Timer Counter 4*/
#define AT91C_ID_TC5    ((unsigned int) 22) /* Timer Counter 5*/
#define AT91C_ID_UHP    ((unsigned int) 23) /* USB Host port*/
#define AT91C_ID_EMAC   ((unsigned int) 24) /* Ethernet MAC*/
#define AT91C_ID_IRQ0   ((unsigned int) 25) /* Advanced Interrupt Controller (IRQ0)*/
#define AT91C_ID_IRQ1   ((unsigned int) 26) /* Advanced Interrupt Controller (IRQ1)*/
#define AT91C_ID_IRQ2   ((unsigned int) 27) /* Advanced Interrupt Controller (IRQ2)*/
#define AT91C_ID_IRQ3   ((unsigned int) 28) /* Advanced Interrupt Controller (IRQ3)*/
#define AT91C_ID_IRQ4   ((unsigned int) 29) /* Advanced Interrupt Controller (IRQ4)*/
#define AT91C_ID_IRQ5   ((unsigned int) 30) /* Advanced Interrupt Controller (IRQ5)*/
#define AT91C_ID_IRQ6   ((unsigned int) 31) /* Advanced Interrupt Controller (IRQ6)*/
#define AT91C_ALL_INT   ((unsigned int) 0xFFFFFFFF) /* ALL VALID INTERRUPTS*/

/* ******************************************************************************/
/*               BASE ADDRESS DEFINITIONS FOR AT91RM9200*/
/* ******************************************************************************/
#define AT91C_BASE_SYS       ((AT91PS_SYS) 	0xFFFFF000) /* (SYS) Base Address*/
#define AT91C_BASE_MC        ((AT91PS_MC) 	0xFFFFFF00) /* (MC) Base Address*/
#define AT91C_BASE_RTC       ((AT91PS_RTC) 	0xFFFFFE00) /* (RTC) Base Address*/
#define AT91C_BASE_ST        ((AT91PS_ST) 	0xFFFFFD00) /* (ST) Base Address*/
#define AT91C_BASE_PMC       ((AT91PS_PMC) 	0xFFFFFC00) /* (PMC) Base Address*/
#define AT91C_BASE_CKGR      ((AT91PS_CKGR) 	0xFFFFFC20) /* (CKGR) Base Address*/
#define AT91C_BASE_PIOD      ((AT91PS_PIO) 	0xFFFFFA00) /* (PIOD) Base Address*/
#define AT91C_BASE_PIOC      ((AT91PS_PIO) 	0xFFFFF800) /* (PIOC) Base Address*/
#define AT91C_BASE_PIOB      ((AT91PS_PIO) 	0xFFFFF600) /* (PIOB) Base Address*/
#define AT91C_BASE_PIOA      ((AT91PS_PIO) 	0xFFFFF400) /* (PIOA) Base Address*/
#define AT91C_BASE_DBGU      ((AT91PS_DBGU) 	0xFFFFF200) /* (DBGU) Base Address*/
#define AT91C_BASE_PDC_DBGU  ((AT91PS_PDC) 	0xFFFFF300) /* (PDC_DBGU) Base Address*/
#define AT91C_BASE_AIC       ((AT91PS_AIC) 	0xFFFFF000) /* (AIC) Base Address*/
#define AT91C_BASE_PDC_SPI   ((AT91PS_PDC) 	0xFFFE0100) /* (PDC_SPI) Base Address*/
#define AT91C_BASE_SPI       ((AT91PS_SPI) 	0xFFFE0000) /* (SPI) Base Address*/
#define AT91C_BASE_PDC_SSC2  ((AT91PS_PDC) 	0xFFFD8100) /* (PDC_SSC2) Base Address*/
#define AT91C_BASE_SSC2      ((AT91PS_SSC) 	0xFFFD8000) /* (SSC2) Base Address*/
#define AT91C_BASE_PDC_SSC1  ((AT91PS_PDC) 	0xFFFD4100) /* (PDC_SSC1) Base Address*/
#define AT91C_BASE_SSC1      ((AT91PS_SSC) 	0xFFFD4000) /* (SSC1) Base Address*/
#define AT91C_BASE_PDC_SSC0  ((AT91PS_PDC) 	0xFFFD0100) /* (PDC_SSC0) Base Address*/
#define AT91C_BASE_SSC0      ((AT91PS_SSC) 	0xFFFD0000) /* (SSC0) Base Address*/
#define AT91C_BASE_PDC_US3   ((AT91PS_PDC) 	0xFFFCC100) /* (PDC_US3) Base Address*/
#define AT91C_BASE_US3       ((AT91PS_USART) 	0xFFFCC000) /* (US3) Base Address*/
#define AT91C_BASE_PDC_US2   ((AT91PS_PDC) 	0xFFFC8100) /* (PDC_US2) Base Address*/
#define AT91C_BASE_US2       ((AT91PS_USART) 	0xFFFC8000) /* (US2) Base Address*/
#define AT91C_BASE_PDC_US1   ((AT91PS_PDC) 	0xFFFC4100) /* (PDC_US1) Base Address*/
#define AT91C_BASE_US1       ((AT91PS_USART) 	0xFFFC4000) /* (US1) Base Address*/
#define AT91C_BASE_PDC_US0   ((AT91PS_PDC) 	0xFFFC0100) /* (PDC_US0) Base Address*/
#define AT91C_BASE_US0       ((AT91PS_USART) 	0xFFFC0000) /* (US0) Base Address*/
#define AT91C_BASE_TWI       ((AT91PS_TWI) 	0xFFFB8000) /* (TWI) Base Address*/
#define AT91C_BASE_PDC_MCI   ((AT91PS_PDC) 	0xFFFB4100) /* (PDC_MCI) Base Address*/
#define AT91C_BASE_MCI       ((AT91PS_MCI) 	0xFFFB4000) /* (MCI) Base Address*/
#define AT91C_BASE_UDP       ((AT91PS_UDP) 	0xFFFB0000) /* (UDP) Base Address*/
#define AT91C_BASE_TC5       ((AT91PS_TC) 	0xFFFA4080) /* (TC5) Base Address*/
#define AT91C_BASE_TC4       ((AT91PS_TC) 	0xFFFA4040) /* (TC4) Base Address*/
#define AT91C_BASE_TC3       ((AT91PS_TC) 	0xFFFA4000) /* (TC3) Base Address*/
#define AT91C_BASE_TCB1      ((AT91PS_TCB) 	0xFFFA4000) /* (TCB1) Base Address*/
#define AT91C_BASE_TC2       ((AT91PS_TC) 	0xFFFA0080) /* (TC2) Base Address*/
#define AT91C_BASE_TC1       ((AT91PS_TC) 	0xFFFA0040) /* (TC1) Base Address*/
#define AT91C_BASE_TC0       ((AT91PS_TC) 	0xFFFA0000) /* (TC0) Base Address*/
#define AT91C_BASE_TCB0      ((AT91PS_TCB) 	0xFFFA0000) /* (TCB0) Base Address*/
#define AT91C_BASE_UHP       ((AT91PS_UHP) 	0x00300000) /* (UHP) Base Address*/
#define AT91C_BASE_EMAC      ((AT91PS_EMAC) 	0xFFFBC000) /* (EMAC) Base Address*/
#define AT91C_BASE_EBI       ((AT91PS_EBI) 	0xFFFFFF60) /* (EBI) Base Address*/
#define AT91C_BASE_SMC2      ((AT91PS_SMC2) 	0xFFFFFF70) /* (SMC2) Base Address*/
#define AT91C_BASE_SDRC      ((AT91PS_SDRC) 	0xFFFFFF90) /* (SDRC) Base Address*/
#define AT91C_BASE_BFC       ((AT91PS_BFC) 	0xFFFFFFC0) /* (BFC) Base Address*/

/* ******************************************************************************/
/*               MEMORY MAPPING DEFINITIONS FOR AT91RM9200*/
/* ******************************************************************************/
/* ISRAM*/
#define AT91C_ISRAM	 ((char *) 	0x00200000) /* Internal SRAM base address*/
#define AT91C_ISRAM_SIZE	 ((unsigned int) 0x00004000) /* Internal SRAM size in byte (16 Kbytes)*/
/* IROM*/
#define AT91C_IROM 	 ((char *) 	0x00100000) /* Internal ROM base address*/
#define AT91C_IROM_SIZE	 ((unsigned int) 0x00020000) /* Internal ROM size in byte (128 Kbytes)*/
#endif /* __IAR_SYSTEMS_ICC__ */

