una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91rm9200.h
/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR System Timer Interface*/
/* - ******************************************************************************/
/* - -------- ST_CR : (ST Offset: 0x0) System Timer Control Register -------- */
AT91C_ST_WDRST            EQU (0x1 <<  0) ;- (ST) Watchdog Timer Restart
/* - -------- ST_PIMR : (ST Offset: 0x4) System Timer Period Interval Mode Register -------- */
AT91C_ST_PIV              EQU (0xFFFF <<  0) ;- (ST) Watchdog Timer Restart
/* - -------- ST_WDMR : (ST Offset: 0x8) System Timer Watchdog Mode Register -------- */
AT91C_ST_WDV              EQU (0xFFFF <<  0) ;- (ST) Watchdog Timer Restart
AT91C_ST_RSTEN            EQU (0x1 << 16) ;- (ST) Reset Enable
AT91C_ST_EXTEN            EQU (0x1 << 17) ;- (ST) External Signal Assertion Enable
/* - -------- ST_RTMR : (ST Offset: 0xc) System Timer Real-time Mode Register -------- */
AT91C_ST_RTPRES           EQU (0xFFFF <<  0) ;- (ST) Real-time Timer Prescaler Value
/* - -------- ST_SR : (ST Offset: 0x10) System Timer Status Register -------- */
AT91C_ST_PITS             EQU (0x1 <<  0) ;- (ST) Period Interval Timer Interrupt
AT91C_ST_WDOVF            EQU (0x1 <<  1) ;- (ST) Watchdog Overflow
AT91C_ST_RTTINC           EQU (0x1 <<  2) ;- (ST) Real-time Timer Increment
AT91C_ST_ALMS             EQU (0x1 <<  3) ;- (ST) Alarm Status
/* - -------- ST_IER : (ST Offset: 0x14) System Timer Interrupt Enable Register -------- */
/* - -------- ST_IDR : (ST Offset: 0x18) System Timer Interrupt Disable Register -------- */
/* - -------- ST_IMR : (ST Offset: 0x1c) System Timer Interrupt Mask Register -------- */
/* - -------- ST_RTAR : (ST Offset: 0x20) System Timer Real-time Alarm Register -------- */
AT91C_ST_ALMV             EQU (0xFFFFF <<  0) ;- (ST) Alarm Value Value
/* - -------- ST_CRTR : (ST Offset: 0x24) System Timer Current Real-time Register -------- */
AT91C_ST_CRTV             EQU (0xFFFFF <<  0) ;- (ST) Current Real-time Value

/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR Power Management Controler*/
/* - ******************************************************************************/
/* - -------- PMC_SCER : (PMC Offset: 0x0) System Clock Enable Register -------- */
AT91C_PMC_PCK             EQU (0x1 <<  0) ;- (PMC) Processor Clock
AT91C_PMC_UDP             EQU (0x1 <<  1) ;- (PMC) USB Device Port Clock
AT91C_PMC_MCKUDP          EQU (0x1 <<  2) ;- (PMC) USB Device Port Master Clock Automatic Disable on Suspend
AT91C_PMC_UHP             EQU (0x1 <<  4) ;- (PMC) USB Host Port Clock
AT91C_PMC_PCK0            EQU (0x1 <<  8) ;- (PMC) Programmable Clock Output
AT91C_PMC_PCK1            EQU (0x1 <<  9) ;- (PMC) Programmable Clock Output
AT91C_PMC_PCK2            EQU (0x1 << 10) ;- (PMC) Programmable Clock Output
AT91C_PMC_PCK3            EQU (0x1 << 11) ;- (PMC) Programmable Clock Output
AT91C_PMC_PCK4            EQU (0x1 << 12) ;- (PMC) Programmable Clock Output
AT91C_PMC_PCK5            EQU (0x1 << 13) ;- (PMC) Programmable Clock Output
AT91C_PMC_PCK6            EQU (0x1 << 14) ;- (PMC) Programmable Clock Output
AT91C_PMC_PCK7            EQU (0x1 << 15) ;- (PMC) Programmable Clock Output
/* - -------- PMC_SCDR : (PMC Offset: 0x4) System Clock Disable Register -------- */
/* - -------- PMC_SCSR : (PMC Offset: 0x8) System Clock Status Register -------- */
/* - -------- PMC_MCKR : (PMC Offset: 0x30) Master Clock Register -------- */
AT91C_PMC_CSS             EQU (0x3 <<  0) ;- (PMC) Programmable Clock Selection
AT91C_PMC_CSS_SLOW_CLK    EQU (0x0) ;- (PMC) Slow Clock is selected
AT91C_PMC_CSS_MAIN_CLK    EQU (0x1) ;- (PMC) Main Clock is selected
AT91C_PMC_CSS_PLLA_CLK    EQU (0x2) ;- (PMC) Clock from PLL A is selected
AT91C_PMC_CSS_PLLB_CLK    EQU (0x3) ;- (PMC) Clock from PLL B is selected
AT91C_PMC_PRES            EQU (0x7 <<  2) ;- (PMC) Programmable Clock Prescaler
AT91C_PMC_PRES_CLK        EQU (0x0 <<  2) ;- (PMC) Selected clock
AT91C_PMC_PRES_CLK_2      EQU (0x1 <<  2) ;- (PMC) Selected clock divided by 2
AT91C_PMC_PRES_CLK_4      EQU (0x2 <<  2) ;- (PMC) Selected clock divided by 4
AT91C_PMC_PRES_CLK_8      EQU (0x3 <<  2) ;- (PMC) Selected clock divided by 8
AT91C_PMC_PRES_CLK_16     EQU (0x4 <<  2) ;- (PMC) Selected clock divided by 16
AT91C_PMC_PRES_CLK_32     EQU (0x5 <<  2) ;- (PMC) Selected clock divided by 32
AT91C_PMC_PRES_CLK_64     EQU (0x6 <<  2) ;- (PMC) Selected clock divided by 64
AT91C_PMC_MDIV            EQU (0x3 <<  8) ;- (PMC) Master Clock Division
AT91C_PMC_MDIV_1          EQU (0x0 <<  8) ;- (PMC) The master clock and the processor clock are the same
AT91C_PMC_MDIV_2          EQU (0x1 <<  8) ;- (PMC) The processor clock is twice as fast as the master clock
AT91C_PMC_MDIV_3          EQU (0x2 <<  8) ;- (PMC) The processor clock is three times faster than the master clock
AT91C_PMC_MDIV_4          EQU (0x3 <<  8) ;- (PMC) The processor clock is four times faster than the master clock
/* - -------- PMC_PCKR : (PMC Offset: 0x40) Programmable Clock Register -------- */
/* - -------- PMC_IER : (PMC Offset: 0x60) PMC Interrupt Enable Register -------- */
AT91C_PMC_MOSCS           EQU (0x1 <<  0) ;- (PMC) MOSC Status/Enable/Disable/Mask
AT91C_PMC_LOCKA           EQU (0x1 <<  1) ;- (PMC) PLL A Status/Enable/Disable/Mask
AT91C_PMC_LOCKB           EQU (0x1 <<  2) ;- (PMC) PLL B Status/Enable/Disable/Mask
AT91C_PMC_MCKRDY          EQU (0x1 <<  3) ;- (PMC) MCK_RDY Status/Enable/Disable/Mask
AT91C_PMC_PCK0RDY         EQU (0x1 <<  8) ;- (PMC) PCK0_RDY Status/Enable/Disable/Mask
AT91C_PMC_PCK1RDY         EQU (0x1 <<  9) ;- (PMC) PCK1_RDY Status/Enable/Disable/Mask
AT91C_PMC_PCK2RDY         EQU (0x1 << 10) ;- (PMC) PCK2_RDY Status/Enable/Disable/Mask
AT91C_PMC_PCK3RDY         EQU (0x1 << 11) ;- (PMC) PCK3_RDY Status/Enable/Disable/Mask
AT91C_PMC_PCK4RDY         EQU (0x1 << 12) ;- (PMC) PCK4_RDY Status/Enable/Disable/Mask
AT91C_PMC_PCK5RDY         EQU (0x1 << 13) ;- (PMC) PCK5_RDY Status/Enable/Disable/Mask
AT91C_PMC_PCK6RDY         EQU (0x1 << 14) ;- (PMC) PCK6_RDY Status/Enable/Disable/Mask
AT91C_PMC_PCK7RDY         EQU (0x1 << 15) ;- (PMC) PCK7_RDY Status/Enable/Disable/Mask
/* - -------- PMC_IDR : (PMC Offset: 0x64) PMC Interrupt Disable Register -------- */
/* - -------- PMC_SR : (PMC Offset: 0x68) PMC Status Register -------- */
/* - -------- PMC_IMR : (PMC Offset: 0x6c) PMC Interrupt Mask Register -------- */

