una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91rm9200.h
/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR External Bus Interface*/
/* - ******************************************************************************/
/* - -------- EBI_CSA : (EBI Offset: 0x0) Chip Select Assignment Register -------- */
AT91C_EBI_CS0A            EQU (0x1 <<  0) ;- (EBI) Chip Select 0 Assignment
AT91C_EBI_CS0A_SMC        EQU (0x0) ;- (EBI) Chip Select 0 is assigned to the Static Memory Controller.
AT91C_EBI_CS0A_BFC        EQU (0x1) ;- (EBI) Chip Select 0 is assigned to the Burst Flash Controller.
AT91C_EBI_CS1A            EQU (0x1 <<  1) ;- (EBI) Chip Select 1 Assignment
AT91C_EBI_CS1A_SMC        EQU (0x0 <<  1) ;- (EBI) Chip Select 1 is assigned to the Static Memory Controller.
AT91C_EBI_CS1A_SDRAMC     EQU (0x1 <<  1) ;- (EBI) Chip Select 1 is assigned to the SDRAM Controller.
AT91C_EBI_CS3A            EQU (0x1 <<  3) ;- (EBI) Chip Select 3 Assignment
AT91C_EBI_CS3A_SMC        EQU (0x0 <<  3) ;- (EBI) Chip Select 3 is only assigned to the Static Memory Controller and NCS3 behaves as defined by the SMC2.
AT91C_EBI_CS3A_SMC_SmartMedia EQU (0x1 <<  3) ;- (EBI) Chip Select 3 is assigned to the Static Memory Controller and the SmartMedia Logic is activated.
AT91C_EBI_CS4A            EQU (0x1 <<  4) ;- (EBI) Chip Select 4 Assignment
AT91C_EBI_CS4A_SMC        EQU (0x0 <<  4) ;- (EBI) Chip Select 4 is assigned to the Static Memory Controller and NCS4,NCS5 and NCS6 behave as defined by the SMC2.
AT91C_EBI_CS4A_SMC_CompactFlash EQU (0x1 <<  4) ;- (EBI) Chip Select 4 is assigned to the Static Memory Controller and the CompactFlash Logic is activated.
/* - -------- EBI_CFGR : (EBI Offset: 0x4) Configuration Register -------- */
AT91C_EBI_DBPUC           EQU (0x1 <<  0) ;- (EBI) Data Bus Pull-Up Configuration
AT91C_EBI_EBSEN           EQU (0x1 <<  1) ;- (EBI) Bus Sharing Enable

/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR Static Memory Controller 2 Interface*/
/* - ******************************************************************************/
/* - -------- SMC2_CSR : (SMC2 Offset: 0x0) SMC2 Chip Select Register -------- */
AT91C_SMC2_NWS            EQU (0x7F <<  0) ;- (SMC2) Number of Wait States
AT91C_SMC2_WSEN           EQU (0x1 <<  7) ;- (SMC2) Wait State Enable
AT91C_SMC2_TDF            EQU (0xF <<  8) ;- (SMC2) Data Float Time
AT91C_SMC2_BAT            EQU (0x1 << 12) ;- (SMC2) Byte Access Type
AT91C_SMC2_DBW            EQU (0x1 << 13) ;- (SMC2) Data Bus Width
AT91C_SMC2_DBW_16         EQU (0x1 << 13) ;- (SMC2) 16-bit.
AT91C_SMC2_DBW_8          EQU (0x2 << 13) ;- (SMC2) 8-bit.
AT91C_SMC2_DRP            EQU (0x1 << 15) ;- (SMC2) Data Read Protocol
AT91C_SMC2_ACSS           EQU (0x3 << 16) ;- (SMC2) Address to Chip Select Setup
AT91C_SMC2_ACSS_STANDARD  EQU (0x0 << 16) ;- (SMC2) Standard, asserted at the beginning of the access and deasserted at the end.
AT91C_SMC2_ACSS_1_CYCLE   EQU (0x1 << 16) ;- (SMC2) One cycle less at the beginning and the end of the access.
AT91C_SMC2_ACSS_2_CYCLES  EQU (0x2 << 16) ;- (SMC2) Two cycles less at the beginning and the end of the access.
AT91C_SMC2_ACSS_3_CYCLES  EQU (0x3 << 16) ;- (SMC2) Three cycles less at the beginning and the end of the access.
AT91C_SMC2_RWSETUP        EQU (0x7 << 24) ;- (SMC2) Read and Write Signal Setup Time
AT91C_SMC2_RWHOLD         EQU (0x7 << 28) ;- (SMC2) Read and Write Signal Hold Time

/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR SDRAM Controller Interface*/
/* - ******************************************************************************/
/* - -------- SDRC_MR : (SDRC Offset: 0x0) SDRAM Controller Mode Register -------- */
AT91C_SDRC_MODE           EQU (0xF <<  0) ;- (SDRC) Mode
AT91C_SDRC_MODE_NORMAL_CMD EQU (0x0) ;- (SDRC) Normal Mode
AT91C_SDRC_MODE_NOP_CMD   EQU (0x1) ;- (SDRC) NOP Command
AT91C_SDRC_MODE_PRCGALL_CMD EQU (0x2) ;- (SDRC) All Banks Precharge Command
AT91C_SDRC_MODE_LMR_CMD   EQU (0x3) ;- (SDRC) Load Mode Register Command
AT91C_SDRC_MODE_RFSH_CMD  EQU (0x4) ;- (SDRC) Refresh Command
AT91C_SDRC_DBW            EQU (0x1 <<  4) ;- (SDRC) Data Bus Width
AT91C_SDRC_DBW_32_BITS    EQU (0x0 <<  4) ;- (SDRC) 32 Bits datas bus
AT91C_SDRC_DBW_16_BITS    EQU (0x1 <<  4) ;- (SDRC) 16 Bits datas bus
/* - -------- SDRC_TR : (SDRC Offset: 0x4) SDRC Refresh Timer Register -------- */
AT91C_SDRC_COUNT          EQU (0xFFF <<  0) ;- (SDRC) Refresh Counter
/* - -------- SDRC_CR : (SDRC Offset: 0x8) SDRAM Configuration Register -------- */
AT91C_SDRC_NC             EQU (0x3 <<  0) ;- (SDRC) Number of Column Bits
AT91C_SDRC_NC_8           EQU (0x0) ;- (SDRC) 8 Bits
AT91C_SDRC_NC_9           EQU (0x1) ;- (SDRC) 9 Bits
AT91C_SDRC_NC_10          EQU (0x2) ;- (SDRC) 10 Bits
AT91C_SDRC_NC_11          EQU (0x3) ;- (SDRC) 11 Bits
AT91C_SDRC_NR             EQU (0x3 <<  2) ;- (SDRC) Number of Row Bits
AT91C_SDRC_NR_11          EQU (0x0 <<  2) ;- (SDRC) 11 Bits
AT91C_SDRC_NR_12          EQU (0x1 <<  2) ;- (SDRC) 12 Bits
AT91C_SDRC_NR_13          EQU (0x2 <<  2) ;- (SDRC) 13 Bits
AT91C_SDRC_NB             EQU (0x1 <<  4) ;- (SDRC) Number of Banks
AT91C_SDRC_NB_2_BANKS     EQU (0x0 <<  4) ;- (SDRC) 2 banks
AT91C_SDRC_NB_4_BANKS     EQU (0x1 <<  4) ;- (SDRC) 4 banks
AT91C_SDRC_CAS            EQU (0x3 <<  5) ;- (SDRC) CAS Latency
AT91C_SDRC_CAS_2          EQU (0x2 <<  5) ;- (SDRC) 2 cycles
AT91C_SDRC_TWR            EQU (0xF <<  7) ;- (SDRC) Number of Write Recovery Time Cycles
AT91C_SDRC_TRC            EQU (0xF << 11) ;- (SDRC) Number of RAS Cycle Time Cycles
AT91C_SDRC_TRP            EQU (0xF << 15) ;- (SDRC) Number of RAS Precharge Time Cycles
AT91C_SDRC_TRCD           EQU (0xF << 19) ;- (SDRC) Number of RAS to CAS Delay Cycles
AT91C_SDRC_TRAS           EQU (0xF << 23) ;- (SDRC) Number of RAS Active Time Cycles
AT91C_SDRC_TXSR           EQU (0xF << 27) ;- (SDRC) Number of Command Recovery Time Cycles
/* - -------- SDRC_SRR : (SDRC Offset: 0xc) SDRAM Controller Self-refresh Register -------- */
AT91C_SDRC_SRCB           EQU (0x1 <<  0) ;- (SDRC) Self-refresh Command Bit
/* - -------- SDRC_LPR : (SDRC Offset: 0x10) SDRAM Controller Low-power Register -------- */
AT91C_SDRC_LPCB           EQU (0x1 <<  0) ;- (SDRC) Low-power Command Bit
/* - -------- SDRC_IER : (SDRC Offset: 0x14) SDRAM Controller Interrupt Enable Register -------- */
AT91C_SDRC_RES            EQU (0x1 <<  0) ;- (SDRC) Refresh Error Status
/* - -------- SDRC_IDR : (SDRC Offset: 0x18) SDRAM Controller Interrupt Disable Register -------- */
/* - -------- SDRC_IMR : (SDRC Offset: 0x1c) SDRAM Controller Interrupt Mask Register -------- */
/* - -------- SDRC_ISR : (SDRC Offset: 0x20) SDRAM Controller Interrupt Status Register -------- */

